Ontaelio/STM32F103-Ublink-framework/stm32f103_gpio_func.h
/*
 * STM32F103 GPIO and AFIO functions library header
 * Part of STM32F103 register and peripherals library
 *
 * Dpcumentation available in the provided MD file.
 *
 * (c) 2019 Dmitry Reznikov ontaelio(at)gmail.com
 *
 * Can be freely used according to the GNU GPL license.
 */

#ifndef STM32F103_GPIO_FUNC_H_
#define STM32F103_GPIO_FUNC_H_

#include <stdio.h>
#include <stm32f103_gpio_reg.h>
#include <stm32f103_rcc_reg.h>

//MODEX
#define INPUT		 0
#define OUTPUT		 2
#define OUTPUT_2MHZ	 2
#define OUTPUT_10MHZ 1
#define OUTPUT_50MHZ 3

//CNF in OUTPUT mode
#define PUSHPULL	 0
#define OPENDRAIN	 4

//CNF + ODR in INPUT mode)
#define FLOATING	 4
#define PULLUP		 9
#define PULLDOWN	 8

class gpio_pin
{
public:
//	gpio_pin(uint8_t pinnum, uint8_t dir, uint8_t cnfod = 4);
//	gpio_pin(uint8_t pinnum);
//	gpio_pin();
	//virtual void init() =0;
	//virtual void set() =0;
	virtual void high() =0;
	//virtual void reset() =0;
	virtual void low() =0;
	//virtual void invert() =0;
	virtual uint8_t read() =0;
	//virtual void write(uint8_t val) =0;
	virtual void mode(uint8_t speed, uint8_t cnf = 4) =0;
	uint8_t pin;
	//virtual void setAll(uint32_t BSRR_value) =0;
	//virtual void resetAll(uint32_t BRR_value) =0;
	//virtual uint32_t readAll() =0;
};

class gpioA : public gpio_pin
{
public:
	gpioA(uint8_t pinnum, uint8_t dir, uint8_t cnfod = 4);
	gpioA(uint8_t pinnum);
	gpioA();
	void init()
	{
		_RCC_(RCC_APB2ENR) |= RCC_APB2ENR_IOPAEN;
	}
	void set();
	void high();
	void reset();
	void low();
	void invert();
	uint8_t read();
	void write(uint8_t val);
	void mode(uint8_t speed, uint8_t cnf = 4);
//	uint8_t pin;

	//these functions are to avoid compiler warnings

	void setAll(uint32_t BSRR_value)
	{
		_GPIOA_(GPIOX_BSRR) = BSRR_value;
	}
	void resetAll(uint32_t BRR_value)
	{
		_GPIOA_(GPIOX_BRR) = BRR_value;
	}
	uint32_t readAll()
	{
		return(_GPIOA_(GPIOX_IDR));
	}

	// these below are better and work; but produce warnings from the compiler
	/*
	volatile uint32_t* BRR = (uint32_t*)  (0x40010814);
	volatile uint32_t* BSRR = (uint32_t*) (0x40010810);
	volatile uint32_t* IDR = (uint32_t*)  (0x40010808);
	*/
};

class gpioB : public gpio_pin
{
public:
	gpioB(uint8_t pinnum, uint8_t dir, uint8_t cnfod = 4);
	gpioB(uint8_t pinnum);
	gpioB();
	void init()
	{
		_RCC_(RCC_APB2ENR) |= RCC_APB2ENR_IOPBEN;
	}
	void set();
	void high();
	void reset();
	void low();
	void invert();
	uint8_t read();
	void write(uint8_t val);
	void mode(uint8_t speed, uint8_t cnf = 4);
	//uint8_t pin;
	void setAll(uint32_t BSRR_value)
	{
		_GPIOB_(GPIOX_BSRR) = BSRR_value;
	}
	void resetAll(uint32_t BRR_value)
	{
		_GPIOB_(GPIOX_BSRR) = BRR_value;
	}
	uint32_t readAll()
	{
		return(_GPIOB_(GPIOX_IDR));
	}
	/*
	volatile uint32_t* BRR = (uint32_t*)  (0x40010C14);
	volatile uint32_t* BSRR = (uint32_t*) (0x40010C10);
	volatile uint32_t* IDR = (uint32_t*)  (0x40010C08);
	*/
};

class gpioC : public gpio_pin
{
public:
	gpioC(uint8_t pinnum, uint8_t dir, uint8_t cnfod = 4);
	gpioC(uint8_t pinnum);
	gpioC();
	void init()
	{
		_RCC_(RCC_APB2ENR) |= RCC_APB2ENR_IOPCEN;
	}
	void set();
	void high();
	void reset();
	void low();
	void invert();
	uint8_t read();
	void write(uint8_t val);
	void mode(uint8_t speed, uint8_t cnf = 4);
	//uint8_t pin;

	void setAll(uint32_t BSRR_value)
	{
		_GPIOC_(GPIOX_BSRR) = BSRR_value;
	}
	void resetAll(uint32_t BRR_value)
	{
		_GPIOC_(GPIOX_BSRR) = BRR_value;
	}
	uint32_t readAll()
	{
		return(_GPIOC_(GPIOX_IDR));
	}

	/*
	volatile uint32_t* BRR = (uint32_t*)  (0x40011014);
	volatile uint32_t* BSRR = (uint32_t*) (0x40011010);
	volatile uint32_t* IDR = (uint32_t*)  (0x40011008);
	*/
};

typedef gpioA gpioA_pin;
typedef gpioB gpioB_pin;
typedef gpioC gpioC_pin;

inline void gpioA_init()
{
	_RCC_(RCC_APB2ENR) |= RCC_APB2ENR_IOPAEN;
}

inline void gpioB_init()
{
	_RCC_(RCC_APB2ENR) |= RCC_APB2ENR_IOPBEN;
}

inline void gpioC_init()
{
	_RCC_(RCC_APB2ENR) |= RCC_APB2ENR_IOPCEN;
}

inline void pinB0_Input()
{
_GPIOB_(GPIOX_CRL) &= ~((8+2+1)<<0);
_GPIOB_(GPIOX_CRL) |= (4)<<0;
}

inline void pinB0_Input_PU()
{
_GPIOB_(GPIOX_CRL) &= ~((4+2+1)<<0);
_GPIOB_(GPIOX_CRL) |= (8)<<0;
_GPIOB_(GPIOX_ODR) |= (1)<<0;
}

inline void pinB0_Input_PD()
{
_GPIOB_(GPIOX_CRL) &= ~((4+2+1)<<0);
_GPIOB_(GPIOX_CRL) |= (8)<<0;
_GPIOB_(GPIOX_ODR) &= ~(1<<0);
}

inline void pinB0_Analog()
{
_GPIOB_(GPIOX_CRL) &= ~((8+4+2+1)<<0);
}

inline void pinB0_Output()
{
_GPIOB_(GPIOX_CRL) &= ~((8+4+1)<<0);
_GPIOB_(GPIOX_CRL) |= (2)<<0;
}

inline void pinB0_Output_OD()
{
_GPIOB_(GPIOX_CRL) &= ~((8+1)<<0);
_GPIOB_(GPIOX_CRL) |= (2+4)<<0;
}

inline void pinB0_Output_PP_2()
{
_GPIOB_(GPIOX_CRL) &= ~((8+4+1)<<0);
_GPIOB_(GPIOX_CRL) |= (2)<<0;
}

inline void pinB0_Output_PP_10()
{
_GPIOB_(GPIOX_CRL) &= ~((8+4+2)<<0);
_GPIOB_(GPIOX_CRL) |= (1)<<0;
}

inline void pinB0_Output_PP_50()
{
_GPIOB_(GPIOX_CRL) &= ~((8+4)<<0);
_GPIOB_(GPIOX_CRL) |= (2+1)<<0;
}

inline void pinB0_Output_OD_2()
{
_GPIOB_(GPIOX_CRL) &= ~((8+1)<<0);
_GPIOB_(GPIOX_CRL) |= (2+4)<<0;
}

inline void pinB0_Output_OD_10()
{
_GPIOB_(GPIOX_CRL) &= ~((8+2)<<0);
_GPIOB_(GPIOX_CRL) |= (4+1)<<0;
}

inline void pinB0_Output_OD_50()
{
_GPIOB_(GPIOX_CRL) &= ~((8)<<0);
_GPIOB_(GPIOX_CRL) |= (4+2+1)<<0;
}

inline void pinB0_Output_AFPP_2()
{
_GPIOB_(GPIOX_CRL) &= ~((4+1)<<0);
_GPIOB_(GPIOX_CRL) |= (8+2)<<0;
}

inline void pinB0_Output_AFPP_10()
{
_GPIOB_(GPIOX_CRL) &= ~((4+2)<<0);
_GPIOB_(GPIOX_CRL) |= (8+1)<<0;
}

inline void pinB0_Output_AFPP_50()
{
_GPIOB_(GPIOX_CRL) &= ~((4)<<0);
_GPIOB_(GPIOX_CRL) |= (8+2+1)<<0;
}

inline void pinB0_Output_AFOD_2()
{
_GPIOB_(GPIOX_CRL) &= ~((1)<<0);
_GPIOB_(GPIOX_CRL) |= (8+2+4)<<0;
}

inline void pinB0_Output_AFOD_10()
{
_GPIOB_(GPIOX_CRL) &= ~((2)<<0);
_GPIOB_(GPIOX_CRL) |= (8+4+1)<<0;
}

inline void pinB0_Output_AFOD_50()
{
_GPIOB_(GPIOX_CRL) |= (8+4+2+1)<<0;
}

inline void pinB1_Input()
{
_GPIOB_(GPIOX_CRL) &= ~((8+2+1)<<4);
_GPIOB_(GPIOX_CRL) |= (4)<<4;
}

inline void pinB1_Input_PU()
{
_GPIOB_(GPIOX_CRL) &= ~((4+2+1)<<4);
_GPIOB_(GPIOX_CRL) |= (8)<<4;
_GPIOB_(GPIOX_ODR) |= (1)<<1;
}

inline void pinB1_Input_PD()
{
_GPIOB_(GPIOX_CRL) &= ~((4+2+1)<<4);
_GPIOB_(GPIOX_CRL) |= (8)<<4;
_GPIOB_(GPIOX_ODR) &= ~(1<<1);
}

