Ontaelio/STM32F103-Ublink-framework/stm32f103_gpio_func.h
inline void pinB1_Analog()
{
_GPIOB_(GPIOX_CRL) &= ~((8+4+2+1)<<4);
}

inline void pinB1_Output()
{
_GPIOB_(GPIOX_CRL) &= ~((8+4+1)<<4);
_GPIOB_(GPIOX_CRL) |= (2)<<4;
}

inline void pinB1_Output_OD()
{
_GPIOB_(GPIOX_CRL) &= ~((8+1)<<4);
_GPIOB_(GPIOX_CRL) |= (2+4)<<4;
}

inline void pinB1_Output_PP_2()
{
_GPIOB_(GPIOX_CRL) &= ~((8+4+1)<<4);
_GPIOB_(GPIOX_CRL) |= (2)<<4;
}

inline void pinB1_Output_PP_10()
{
_GPIOB_(GPIOX_CRL) &= ~((8+4+2)<<4);
_GPIOB_(GPIOX_CRL) |= (1)<<4;
}

inline void pinB1_Output_PP_50()
{
_GPIOB_(GPIOX_CRL) &= ~((8+4)<<4);
_GPIOB_(GPIOX_CRL) |= (2+1)<<4;
}

inline void pinB1_Output_OD_2()
{
_GPIOB_(GPIOX_CRL) &= ~((8+1)<<4);
_GPIOB_(GPIOX_CRL) |= (2+4)<<4;
}

inline void pinB1_Output_OD_10()
{
_GPIOB_(GPIOX_CRL) &= ~((8+2)<<4);
_GPIOB_(GPIOX_CRL) |= (4+1)<<4;
}

inline void pinB1_Output_OD_50()
{
_GPIOB_(GPIOX_CRL) &= ~((8)<<4);
_GPIOB_(GPIOX_CRL) |= (4+2+1)<<4;
}

inline void pinB1_Output_AFPP_2()
{
_GPIOB_(GPIOX_CRL) &= ~((4+1)<<4);
_GPIOB_(GPIOX_CRL) |= (8+2)<<4;
}

inline void pinB1_Output_AFPP_10()
{
_GPIOB_(GPIOX_CRL) &= ~((4+2)<<4);
_GPIOB_(GPIOX_CRL) |= (8+1)<<4;
}

inline void pinB1_Output_AFPP_50()
{
_GPIOB_(GPIOX_CRL) &= ~((4)<<4);
_GPIOB_(GPIOX_CRL) |= (8+2+1)<<4;
}

inline void pinB1_Output_AFOD_2()
{
_GPIOB_(GPIOX_CRL) &= ~((1)<<4);
_GPIOB_(GPIOX_CRL) |= (8+2+4)<<4;
}

inline void pinB1_Output_AFOD_10()
{
_GPIOB_(GPIOX_CRL) &= ~((2)<<4);
_GPIOB_(GPIOX_CRL) |= (8+4+1)<<4;
}

inline void pinB1_Output_AFOD_50()
{
_GPIOB_(GPIOX_CRL) |= (8+4+2+1)<<4;
}

inline void pinB2_Input()
{
_GPIOB_(GPIOX_CRL) &= ~((8+2+1)<<8);
_GPIOB_(GPIOX_CRL) |= (4)<<8;
}

inline void pinB2_Input_PU()
{
_GPIOB_(GPIOX_CRL) &= ~((4+2+1)<<8);
_GPIOB_(GPIOX_CRL) |= (8)<<8;
_GPIOB_(GPIOX_ODR) |= (1)<<2;
}

inline void pinB2_Input_PD()
{
_GPIOB_(GPIOX_CRL) &= ~((4+2+1)<<8);
_GPIOB_(GPIOX_CRL) |= (8)<<8;
_GPIOB_(GPIOX_ODR) &= ~(1<<2);
}

inline void pinB2_Analog()
{
_GPIOB_(GPIOX_CRL) &= ~((8+4+2+1)<<8);
}

inline void pinB2_Output()
{
_GPIOB_(GPIOX_CRL) &= ~((8+4+1)<<8);
_GPIOB_(GPIOX_CRL) |= (2)<<8;
}

inline void pinB2_Output_OD()
{
_GPIOB_(GPIOX_CRL) &= ~((8+1)<<8);
_GPIOB_(GPIOX_CRL) |= (2+4)<<8;
}

inline void pinB2_Output_PP_2()
{
_GPIOB_(GPIOX_CRL) &= ~((8+4+1)<<8);
_GPIOB_(GPIOX_CRL) |= (2)<<8;
}

inline void pinB2_Output_PP_10()
{
_GPIOB_(GPIOX_CRL) &= ~((8+4+2)<<8);
_GPIOB_(GPIOX_CRL) |= (1)<<8;
}

inline void pinB2_Output_PP_50()
{
_GPIOB_(GPIOX_CRL) &= ~((8+4)<<8);
_GPIOB_(GPIOX_CRL) |= (2+1)<<8;
}

inline void pinB2_Output_OD_2()
{
_GPIOB_(GPIOX_CRL) &= ~((8+1)<<8);
_GPIOB_(GPIOX_CRL) |= (2+4)<<8;
}

inline void pinB2_Output_OD_10()
{
_GPIOB_(GPIOX_CRL) &= ~((8+2)<<8);
_GPIOB_(GPIOX_CRL) |= (4+1)<<8;
}

inline void pinB2_Output_OD_50()
{
_GPIOB_(GPIOX_CRL) &= ~((8)<<8);
_GPIOB_(GPIOX_CRL) |= (4+2+1)<<8;
}

inline void pinB2_Output_AFPP_2()
{
_GPIOB_(GPIOX_CRL) &= ~((4+1)<<8);
_GPIOB_(GPIOX_CRL) |= (8+2)<<8;
}

inline void pinB2_Output_AFPP_10()
{
_GPIOB_(GPIOX_CRL) &= ~((4+2)<<8);
_GPIOB_(GPIOX_CRL) |= (8+1)<<8;
}

inline void pinB2_Output_AFPP_50()
{
_GPIOB_(GPIOX_CRL) &= ~((4)<<8);
_GPIOB_(GPIOX_CRL) |= (8+2+1)<<8;
}

inline void pinB2_Output_AFOD_2()
{
_GPIOB_(GPIOX_CRL) &= ~((1)<<8);
_GPIOB_(GPIOX_CRL) |= (8+2+4)<<8;
}

inline void pinB2_Output_AFOD_10()
{
_GPIOB_(GPIOX_CRL) &= ~((2)<<8);
_GPIOB_(GPIOX_CRL) |= (8+4+1)<<8;
}

inline void pinB2_Output_AFOD_50()
{
_GPIOB_(GPIOX_CRL) |= (8+4+2+1)<<8;
}

inline void pinB3_Input()
{
_GPIOB_(GPIOX_CRL) &= ~((8+2+1)<<12);
_GPIOB_(GPIOX_CRL) |= (4)<<12;
}

inline void pinB3_Input_PU()
{
_GPIOB_(GPIOX_CRL) &= ~((4+2+1)<<12);
_GPIOB_(GPIOX_CRL) |= (8)<<12;
_GPIOB_(GPIOX_ODR) |= (1)<<3;
}

inline void pinB3_Input_PD()
{
_GPIOB_(GPIOX_CRL) &= ~((4+2+1)<<12);
_GPIOB_(GPIOX_CRL) |= (8)<<12;
_GPIOB_(GPIOX_ODR) &= ~(1<<3);
}

inline void pinB3_Analog()
{
_GPIOB_(GPIOX_CRL) &= ~((8+4+2+1)<<12);
}

inline void pinB3_Output()
{
_GPIOB_(GPIOX_CRL) &= ~((8+4+1)<<12);
_GPIOB_(GPIOX_CRL) |= (2)<<12;
}

inline void pinB3_Output_OD()
{
_GPIOB_(GPIOX_CRL) &= ~((8+1)<<12);
_GPIOB_(GPIOX_CRL) |= (2+4)<<12;
}

inline void pinB3_Output_PP_2()
{
_GPIOB_(GPIOX_CRL) &= ~((8+4+1)<<12);
_GPIOB_(GPIOX_CRL) |= (2)<<12;
}

inline void pinB3_Output_PP_10()
{
_GPIOB_(GPIOX_CRL) &= ~((8+4+2)<<12);
_GPIOB_(GPIOX_CRL) |= (1)<<12;
}

inline void pinB3_Output_PP_50()
{
_GPIOB_(GPIOX_CRL) &= ~((8+4)<<12);
_GPIOB_(GPIOX_CRL) |= (2+1)<<12;
}

inline void pinB3_Output_OD_2()
{
_GPIOB_(GPIOX_CRL) &= ~((8+1)<<12);
_GPIOB_(GPIOX_CRL) |= (2+4)<<12;
}

inline void pinB3_Output_OD_10()
{
_GPIOB_(GPIOX_CRL) &= ~((8+2)<<12);
_GPIOB_(GPIOX_CRL) |= (4+1)<<12;
}

inline void pinB3_Output_OD_50()
{
_GPIOB_(GPIOX_CRL) &= ~((8)<<12);
_GPIOB_(GPIOX_CRL) |= (4+2+1)<<12;
}

inline void pinB3_Output_AFPP_2()
{
_GPIOB_(GPIOX_CRL) &= ~((4+1)<<12);
_GPIOB_(GPIOX_CRL) |= (8+2)<<12;
}

inline void pinB3_Output_AFPP_10()
{
_GPIOB_(GPIOX_CRL) &= ~((4+2)<<12);
_GPIOB_(GPIOX_CRL) |= (8+1)<<12;
}

inline void pinB3_Output_AFPP_50()
{
_GPIOB_(GPIOX_CRL) &= ~((4)<<12);
_GPIOB_(GPIOX_CRL) |= (8+2+1)<<12;
}

inline void pinB3_Output_AFOD_2()
{
_GPIOB_(GPIOX_CRL) &= ~((1)<<12);
_GPIOB_(GPIOX_CRL) |= (8+2+4)<<12;
}

inline void pinB3_Output_AFOD_10()
{
_GPIOB_(GPIOX_CRL) &= ~((2)<<12);
_GPIOB_(GPIOX_CRL) |= (8+4+1)<<12;
}

inline void pinB3_Output_AFOD_50()
{
_GPIOB_(GPIOX_CRL) |= (8+4+2+1)<<12;
}

inline void pinB4_Input()
{
_GPIOB_(GPIOX_CRL) &= ~((8+2+1)<<16);
_GPIOB_(GPIOX_CRL) |= (4)<<16;
}

inline void pinB4_Input_PU()
{
_GPIOB_(GPIOX_CRL) &= ~((4+2+1)<<16);
_GPIOB_(GPIOX_CRL) |= (8)<<16;
_GPIOB_(GPIOX_ODR) |= (1)<<4;
}

inline void pinB4_Input_PD()
{
_GPIOB_(GPIOX_CRL) &= ~((4+2+1)<<16);
_GPIOB_(GPIOX_CRL) |= (8)<<16;
_GPIOB_(GPIOX_ODR) &= ~(1<<4);
}

inline void pinB4_Analog()
{
_GPIOB_(GPIOX_CRL) &= ~((8+4+2+1)<<16);
}

inline void pinB4_Output()
{
_GPIOB_(GPIOX_CRL) &= ~((8+4+1)<<16);
_GPIOB_(GPIOX_CRL) |= (2)<<16;
}

inline void pinB4_Output_OD()
{
_GPIOB_(GPIOX_CRL) &= ~((8+1)<<16);
_GPIOB_(GPIOX_CRL) |= (2+4)<<16;
}

inline void pinB4_Output_PP_2()
{
_GPIOB_(GPIOX_CRL) &= ~((8+4+1)<<16);
_GPIOB_(GPIOX_CRL) |= (2)<<16;
}

