Ontaelio/STM32F103-Ublink-framework/stm32f103_gpio_func.h
inline void pinB4_Output_PP_10()
{
_GPIOB_(GPIOX_CRL) &= ~((8+4+2)<<16);
_GPIOB_(GPIOX_CRL) |= (1)<<16;
}

inline void pinB4_Output_PP_50()
{
_GPIOB_(GPIOX_CRL) &= ~((8+4)<<16);
_GPIOB_(GPIOX_CRL) |= (2+1)<<16;
}

inline void pinB4_Output_OD_2()
{
_GPIOB_(GPIOX_CRL) &= ~((8+1)<<16);
_GPIOB_(GPIOX_CRL) |= (2+4)<<16;
}

inline void pinB4_Output_OD_10()
{
_GPIOB_(GPIOX_CRL) &= ~((8+2)<<16);
_GPIOB_(GPIOX_CRL) |= (4+1)<<16;
}

inline void pinB4_Output_OD_50()
{
_GPIOB_(GPIOX_CRL) &= ~((8)<<16);
_GPIOB_(GPIOX_CRL) |= (4+2+1)<<16;
}

inline void pinB4_Output_AFPP_2()
{
_GPIOB_(GPIOX_CRL) &= ~((4+1)<<16);
_GPIOB_(GPIOX_CRL) |= (8+2)<<16;
}

inline void pinB4_Output_AFPP_10()
{
_GPIOB_(GPIOX_CRL) &= ~((4+2)<<16);
_GPIOB_(GPIOX_CRL) |= (8+1)<<16;
}

inline void pinB4_Output_AFPP_50()
{
_GPIOB_(GPIOX_CRL) &= ~((4)<<16);
_GPIOB_(GPIOX_CRL) |= (8+2+1)<<16;
}

inline void pinB4_Output_AFOD_2()
{
_GPIOB_(GPIOX_CRL) &= ~((1)<<16);
_GPIOB_(GPIOX_CRL) |= (8+2+4)<<16;
}

inline void pinB4_Output_AFOD_10()
{
_GPIOB_(GPIOX_CRL) &= ~((2)<<16);
_GPIOB_(GPIOX_CRL) |= (8+4+1)<<16;
}

inline void pinB4_Output_AFOD_50()
{
_GPIOB_(GPIOX_CRL) |= (8+4+2+1)<<16;
}

inline void pinB5_Input()
{
_GPIOB_(GPIOX_CRL) &= ~((8+2+1)<<20);
_GPIOB_(GPIOX_CRL) |= (4)<<20;
}

inline void pinB5_Input_PU()
{
_GPIOB_(GPIOX_CRL) &= ~((4+2+1)<<20);
_GPIOB_(GPIOX_CRL) |= (8)<<20;
_GPIOB_(GPIOX_ODR) |= (1)<<5;
}

inline void pinB5_Input_PD()
{
_GPIOB_(GPIOX_CRL) &= ~((4+2+1)<<20);
_GPIOB_(GPIOX_CRL) |= (8)<<20;
_GPIOB_(GPIOX_ODR) &= ~(1<<5);
}

inline void pinB5_Analog()
{
_GPIOB_(GPIOX_CRL) &= ~((8+4+2+1)<<20);
}

inline void pinB5_Output()
{
_GPIOB_(GPIOX_CRL) &= ~((8+4+1)<<20);
_GPIOB_(GPIOX_CRL) |= (2)<<20;
}

inline void pinB5_Output_OD()
{
_GPIOB_(GPIOX_CRL) &= ~((8+1)<<20);
_GPIOB_(GPIOX_CRL) |= (2+4)<<20;
}

inline void pinB5_Output_PP_2()
{
_GPIOB_(GPIOX_CRL) &= ~((8+4+1)<<20);
_GPIOB_(GPIOX_CRL) |= (2)<<20;
}

inline void pinB5_Output_PP_10()
{
_GPIOB_(GPIOX_CRL) &= ~((8+4+2)<<20);
_GPIOB_(GPIOX_CRL) |= (1)<<20;
}

inline void pinB5_Output_PP_50()
{
_GPIOB_(GPIOX_CRL) &= ~((8+4)<<20);
_GPIOB_(GPIOX_CRL) |= (2+1)<<20;
}

inline void pinB5_Output_OD_2()
{
_GPIOB_(GPIOX_CRL) &= ~((8+1)<<20);
_GPIOB_(GPIOX_CRL) |= (2+4)<<20;
}

inline void pinB5_Output_OD_10()
{
_GPIOB_(GPIOX_CRL) &= ~((8+2)<<20);
_GPIOB_(GPIOX_CRL) |= (4+1)<<20;
}

inline void pinB5_Output_OD_50()
{
_GPIOB_(GPIOX_CRL) &= ~((8)<<20);
_GPIOB_(GPIOX_CRL) |= (4+2+1)<<20;
}

inline void pinB5_Output_AFPP_2()
{
_GPIOB_(GPIOX_CRL) &= ~((4+1)<<20);
_GPIOB_(GPIOX_CRL) |= (8+2)<<20;
}

inline void pinB5_Output_AFPP_10()
{
_GPIOB_(GPIOX_CRL) &= ~((4+2)<<20);
_GPIOB_(GPIOX_CRL) |= (8+1)<<20;
}

inline void pinB5_Output_AFPP_50()
{
_GPIOB_(GPIOX_CRL) &= ~((4)<<20);
_GPIOB_(GPIOX_CRL) |= (8+2+1)<<20;
}

inline void pinB5_Output_AFOD_2()
{
_GPIOB_(GPIOX_CRL) &= ~((1)<<20);
_GPIOB_(GPIOX_CRL) |= (8+2+4)<<20;
}

inline void pinB5_Output_AFOD_10()
{
_GPIOB_(GPIOX_CRL) &= ~((2)<<20);
_GPIOB_(GPIOX_CRL) |= (8+4+1)<<20;
}

inline void pinB5_Output_AFOD_50()
{
_GPIOB_(GPIOX_CRL) |= (8+4+2+1)<<20;
}

inline void pinB6_Input()
{
_GPIOB_(GPIOX_CRL) &= ~((8+2+1)<<24);
_GPIOB_(GPIOX_CRL) |= (4)<<24;
}

inline void pinB6_Input_PU()
{
_GPIOB_(GPIOX_CRL) &= ~((4+2+1)<<24);
_GPIOB_(GPIOX_CRL) |= (8)<<24;
_GPIOB_(GPIOX_ODR) |= (1)<<6;
}

inline void pinB6_Input_PD()
{
_GPIOB_(GPIOX_CRL) &= ~((4+2+1)<<24);
_GPIOB_(GPIOX_CRL) |= (8)<<24;
_GPIOB_(GPIOX_ODR) &= ~(1<<6);
}

inline void pinB6_Analog()
{
_GPIOB_(GPIOX_CRL) &= ~((8+4+2+1)<<24);
}

inline void pinB6_Output()
{
_GPIOB_(GPIOX_CRL) &= ~((8+4+1)<<24);
_GPIOB_(GPIOX_CRL) |= (2)<<24;
}

inline void pinB6_Output_OD()
{
_GPIOB_(GPIOX_CRL) &= ~((8+1)<<24);
_GPIOB_(GPIOX_CRL) |= (2+4)<<24;
}

inline void pinB6_Output_PP_2()
{
_GPIOB_(GPIOX_CRL) &= ~((8+4+1)<<24);
_GPIOB_(GPIOX_CRL) |= (2)<<24;
}

inline void pinB6_Output_PP_10()
{
_GPIOB_(GPIOX_CRL) &= ~((8+4+2)<<24);
_GPIOB_(GPIOX_CRL) |= (1)<<24;
}

inline void pinB6_Output_PP_50()
{
_GPIOB_(GPIOX_CRL) &= ~((8+4)<<24);
_GPIOB_(GPIOX_CRL) |= (2+1)<<24;
}

inline void pinB6_Output_OD_2()
{
_GPIOB_(GPIOX_CRL) &= ~((8+1)<<24);
_GPIOB_(GPIOX_CRL) |= (2+4)<<24;
}

inline void pinB6_Output_OD_10()
{
_GPIOB_(GPIOX_CRL) &= ~((8+2)<<24);
_GPIOB_(GPIOX_CRL) |= (4+1)<<24;
}

inline void pinB6_Output_OD_50()
{
_GPIOB_(GPIOX_CRL) &= ~((8)<<24);
_GPIOB_(GPIOX_CRL) |= (4+2+1)<<24;
}

inline void pinB6_Output_AFPP_2()
{
_GPIOB_(GPIOX_CRL) &= ~((4+1)<<24);
_GPIOB_(GPIOX_CRL) |= (8+2)<<24;
}

inline void pinB6_Output_AFPP_10()
{
_GPIOB_(GPIOX_CRL) &= ~((4+2)<<24);
_GPIOB_(GPIOX_CRL) |= (8+1)<<24;
}

inline void pinB6_Output_AFPP_50()
{
_GPIOB_(GPIOX_CRL) &= ~((4)<<24);
_GPIOB_(GPIOX_CRL) |= (8+2+1)<<24;
}

inline void pinB6_Output_AFOD_2()
{
_GPIOB_(GPIOX_CRL) &= ~((1)<<24);
_GPIOB_(GPIOX_CRL) |= (8+2+4)<<24;
}

inline void pinB6_Output_AFOD_10()
{
_GPIOB_(GPIOX_CRL) &= ~((2)<<24);
_GPIOB_(GPIOX_CRL) |= (8+4+1)<<24;
}

inline void pinB6_Output_AFOD_50()
{
_GPIOB_(GPIOX_CRL) |= (8+4+2+1)<<24;
}

inline void pinB7_Input()
{
_GPIOB_(GPIOX_CRL) &= ~((8+2+1)<<28);
_GPIOB_(GPIOX_CRL) |= (4)<<28;
}

inline void pinB7_Input_PU()
{
_GPIOB_(GPIOX_CRL) &= ~((4+2+1)<<28);
_GPIOB_(GPIOX_CRL) |= (8)<<28;
_GPIOB_(GPIOX_ODR) |= (1)<<7;
}

inline void pinB7_Input_PD()
{
_GPIOB_(GPIOX_CRL) &= ~((4+2+1)<<28);
_GPIOB_(GPIOX_CRL) |= (8)<<28;
_GPIOB_(GPIOX_ODR) &= ~(1<<7);
}

inline void pinB7_Analog()
{
_GPIOB_(GPIOX_CRL) &= ~((8+4+2+1)<<28);
}

inline void pinB7_Output()
{
_GPIOB_(GPIOX_CRL) &= ~((8+4+1)<<28);
_GPIOB_(GPIOX_CRL) |= (2)<<28;
}

inline void pinB7_Output_OD()
{
_GPIOB_(GPIOX_CRL) &= ~((8+1)<<28);
_GPIOB_(GPIOX_CRL) |= (2+4)<<28;
}

inline void pinB7_Output_PP_2()
{
_GPIOB_(GPIOX_CRL) &= ~((8+4+1)<<28);
_GPIOB_(GPIOX_CRL) |= (2)<<28;
}

inline void pinB7_Output_PP_10()
{
_GPIOB_(GPIOX_CRL) &= ~((8+4+2)<<28);
_GPIOB_(GPIOX_CRL) |= (1)<<28;
}

inline void pinB7_Output_PP_50()
{
_GPIOB_(GPIOX_CRL) &= ~((8+4)<<28);
_GPIOB_(GPIOX_CRL) |= (2+1)<<28;
}

inline void pinB7_Output_OD_2()
{
_GPIOB_(GPIOX_CRL) &= ~((8+1)<<28);
_GPIOB_(GPIOX_CRL) |= (2+4)<<28;
}

