Ontaelio/STM32F103-Ublink-framework/stm32f103_gpio_func.h
inline void pinB7_Output_OD_10()
{
_GPIOB_(GPIOX_CRL) &= ~((8+2)<<28);
_GPIOB_(GPIOX_CRL) |= (4+1)<<28;
}

inline void pinB7_Output_OD_50()
{
_GPIOB_(GPIOX_CRL) &= ~((8)<<28);
_GPIOB_(GPIOX_CRL) |= (4+2+1)<<28;
}

inline void pinB7_Output_AFPP_2()
{
_GPIOB_(GPIOX_CRL) &= ~((4+1)<<28);
_GPIOB_(GPIOX_CRL) |= (8+2)<<28;
}

inline void pinB7_Output_AFPP_10()
{
_GPIOB_(GPIOX_CRL) &= ~((4+2)<<28);
_GPIOB_(GPIOX_CRL) |= (8+1)<<28;
}

inline void pinB7_Output_AFPP_50()
{
_GPIOB_(GPIOX_CRL) &= ~((4)<<28);
_GPIOB_(GPIOX_CRL) |= (8+2+1)<<28;
}

inline void pinB7_Output_AFOD_2()
{
_GPIOB_(GPIOX_CRL) &= ~((1)<<28);
_GPIOB_(GPIOX_CRL) |= (8+2+4)<<28;
}

inline void pinB7_Output_AFOD_10()
{
_GPIOB_(GPIOX_CRL) &= ~((2)<<28);
_GPIOB_(GPIOX_CRL) |= (8+4+1)<<28;
}

inline void pinB7_Output_AFOD_50()
{
_GPIOB_(GPIOX_CRL) |= (8+4+2+1)<<28;
}

inline void pinB8_Input()
{
_GPIOB_(GPIOX_CRH) &= ~((8+2+1)<<0);
_GPIOB_(GPIOX_CRH) |= (4)<<0;
}

inline void pinB8_Input_PU()
{
_GPIOB_(GPIOX_CRH) &= ~((4+2+1)<<0);
_GPIOB_(GPIOX_CRH) |= (8)<<0;
_GPIOB_(GPIOX_ODR) |= (1)<<0;
}

inline void pinB8_Input_PD()
{
_GPIOB_(GPIOX_CRH) &= ~((4+2+1)<<0);
_GPIOB_(GPIOX_CRH) |= (8)<<0;
_GPIOB_(GPIOX_ODR) &= ~(1<<0);
}

inline void pinB8_Analog()
{
_GPIOB_(GPIOX_CRH) &= ~((8+4+2+1)<<0);
}

inline void pinB8_Output()
{
_GPIOB_(GPIOX_CRH) &= ~((8+4+1)<<0);
_GPIOB_(GPIOX_CRH) |= (2)<<0;
}

inline void pinB8_Output_OD()
{
_GPIOB_(GPIOX_CRH) &= ~((8+1)<<0);
_GPIOB_(GPIOX_CRH) |= (2+4)<<0;
}

inline void pinB8_Output_PP_2()
{
_GPIOB_(GPIOX_CRH) &= ~((8+4+1)<<0);
_GPIOB_(GPIOX_CRH) |= (2)<<0;
}

inline void pinB8_Output_PP_10()
{
_GPIOB_(GPIOX_CRH) &= ~((8+4+2)<<0);
_GPIOB_(GPIOX_CRH) |= (1)<<0;
}

inline void pinB8_Output_PP_50()
{
_GPIOB_(GPIOX_CRH) &= ~((8+4)<<0);
_GPIOB_(GPIOX_CRH) |= (2+1)<<0;
}

inline void pinB8_Output_OD_2()
{
_GPIOB_(GPIOX_CRH) &= ~((8+1)<<0);
_GPIOB_(GPIOX_CRH) |= (2+4)<<0;
}

inline void pinB8_Output_OD_10()
{
_GPIOB_(GPIOX_CRH) &= ~((8+2)<<0);
_GPIOB_(GPIOX_CRH) |= (4+1)<<0;
}

inline void pinB8_Output_OD_50()
{
_GPIOB_(GPIOX_CRH) &= ~((8)<<0);
_GPIOB_(GPIOX_CRH) |= (4+2+1)<<0;
}

inline void pinB8_Output_AFPP_2()
{
_GPIOB_(GPIOX_CRH) &= ~((4+1)<<0);
_GPIOB_(GPIOX_CRH) |= (8+2)<<0;
}

inline void pinB8_Output_AFPP_10()
{
_GPIOB_(GPIOX_CRH) &= ~((4+2)<<0);
_GPIOB_(GPIOX_CRH) |= (8+1)<<0;
}

inline void pinB8_Output_AFPP_50()
{
_GPIOB_(GPIOX_CRH) &= ~((4)<<0);
_GPIOB_(GPIOX_CRH) |= (8+2+1)<<0;
}

inline void pinB8_Output_AFOD_2()
{
_GPIOB_(GPIOX_CRH) &= ~((1)<<0);
_GPIOB_(GPIOX_CRH) |= (8+2+4)<<0;
}

inline void pinB8_Output_AFOD_10()
{
_GPIOB_(GPIOX_CRH) &= ~((2)<<0);
_GPIOB_(GPIOX_CRH) |= (8+4+1)<<0;
}

inline void pinB8_Output_AFOD_50()
{
_GPIOB_(GPIOX_CRH) |= (8+4+2+1)<<0;
}

inline void pinB9_Input()
{
_GPIOB_(GPIOX_CRH) &= ~((8+2+1)<<4);
_GPIOB_(GPIOX_CRH) |= (4)<<4;
}

inline void pinB9_Input_PU()
{
_GPIOB_(GPIOX_CRH) &= ~((4+2+1)<<4);
_GPIOB_(GPIOX_CRH) |= (8)<<4;
_GPIOB_(GPIOX_ODR) |= (1)<<1;
}

inline void pinB9_Input_PD()
{
_GPIOB_(GPIOX_CRH) &= ~((4+2+1)<<4);
_GPIOB_(GPIOX_CRH) |= (8)<<4;
_GPIOB_(GPIOX_ODR) &= ~(1<<1);
}

inline void pinB9_Analog()
{
_GPIOB_(GPIOX_CRH) &= ~((8+4+2+1)<<4);
}

inline void pinB9_Output()
{
_GPIOB_(GPIOX_CRH) &= ~((8+4+1)<<4);
_GPIOB_(GPIOX_CRH) |= (2)<<4;
}

inline void pinB9_Output_OD()
{
_GPIOB_(GPIOX_CRH) &= ~((8+1)<<4);
_GPIOB_(GPIOX_CRH) |= (2+4)<<4;
}

inline void pinB9_Output_PP_2()
{
_GPIOB_(GPIOX_CRH) &= ~((8+4+1)<<4);
_GPIOB_(GPIOX_CRH) |= (2)<<4;
}

inline void pinB9_Output_PP_10()
{
_GPIOB_(GPIOX_CRH) &= ~((8+4+2)<<4);
_GPIOB_(GPIOX_CRH) |= (1)<<4;
}

inline void pinB9_Output_PP_50()
{
_GPIOB_(GPIOX_CRH) &= ~((8+4)<<4);
_GPIOB_(GPIOX_CRH) |= (2+1)<<4;
}

inline void pinB9_Output_OD_2()
{
_GPIOB_(GPIOX_CRH) &= ~((8+1)<<4);
_GPIOB_(GPIOX_CRH) |= (2+4)<<4;
}

inline void pinB9_Output_OD_10()
{
_GPIOB_(GPIOX_CRH) &= ~((8+2)<<4);
_GPIOB_(GPIOX_CRH) |= (4+1)<<4;
}

inline void pinB9_Output_OD_50()
{
_GPIOB_(GPIOX_CRH) &= ~((8)<<4);
_GPIOB_(GPIOX_CRH) |= (4+2+1)<<4;
}

inline void pinB9_Output_AFPP_2()
{
_GPIOB_(GPIOX_CRH) &= ~((4+1)<<4);
_GPIOB_(GPIOX_CRH) |= (8+2)<<4;
}

inline void pinB9_Output_AFPP_10()
{
_GPIOB_(GPIOX_CRH) &= ~((4+2)<<4);
_GPIOB_(GPIOX_CRH) |= (8+1)<<4;
}

inline void pinB9_Output_AFPP_50()
{
_GPIOB_(GPIOX_CRH) &= ~((4)<<4);
_GPIOB_(GPIOX_CRH) |= (8+2+1)<<4;
}

inline void pinB9_Output_AFOD_2()
{
_GPIOB_(GPIOX_CRH) &= ~((1)<<4);
_GPIOB_(GPIOX_CRH) |= (8+2+4)<<4;
}

inline void pinB9_Output_AFOD_10()
{
_GPIOB_(GPIOX_CRH) &= ~((2)<<4);
_GPIOB_(GPIOX_CRH) |= (8+4+1)<<4;
}

inline void pinB9_Output_AFOD_50()
{
_GPIOB_(GPIOX_CRH) |= (8+4+2+1)<<4;
}

inline void pinB10_Input()
{
_GPIOB_(GPIOX_CRH) &= ~((8+2+1)<<8);
_GPIOB_(GPIOX_CRH) |= (4)<<8;
}

inline void pinB10_Input_PU()
{
_GPIOB_(GPIOX_CRH) &= ~((4+2+1)<<8);
_GPIOB_(GPIOX_CRH) |= (8)<<8;
_GPIOB_(GPIOX_ODR) |= (1)<<2;
}

inline void pinB10_Input_PD()
{
_GPIOB_(GPIOX_CRH) &= ~((4+2+1)<<8);
_GPIOB_(GPIOX_CRH) |= (8)<<8;
_GPIOB_(GPIOX_ODR) &= ~(1<<2);
}

inline void pinB10_Analog()
{
_GPIOB_(GPIOX_CRH) &= ~((8+4+2+1)<<8);
}

inline void pinB10_Output()
{
_GPIOB_(GPIOX_CRH) &= ~((8+4+1)<<8);
_GPIOB_(GPIOX_CRH) |= (2)<<8;
}

inline void pinB10_Output_OD()
{
_GPIOB_(GPIOX_CRH) &= ~((8+1)<<8);
_GPIOB_(GPIOX_CRH) |= (2+4)<<8;
}

inline void pinB10_Output_PP_2()
{
_GPIOB_(GPIOX_CRH) &= ~((8+4+1)<<8);
_GPIOB_(GPIOX_CRH) |= (2)<<8;
}

inline void pinB10_Output_PP_10()
{
_GPIOB_(GPIOX_CRH) &= ~((8+4+2)<<8);
_GPIOB_(GPIOX_CRH) |= (1)<<8;
}

inline void pinB10_Output_PP_50()
{
_GPIOB_(GPIOX_CRH) &= ~((8+4)<<8);
_GPIOB_(GPIOX_CRH) |= (2+1)<<8;
}

inline void pinB10_Output_OD_2()
{
_GPIOB_(GPIOX_CRH) &= ~((8+1)<<8);
_GPIOB_(GPIOX_CRH) |= (2+4)<<8;
}

inline void pinB10_Output_OD_10()
{
_GPIOB_(GPIOX_CRH) &= ~((8+2)<<8);
_GPIOB_(GPIOX_CRH) |= (4+1)<<8;
}

inline void pinB10_Output_OD_50()
{
_GPIOB_(GPIOX_CRH) &= ~((8)<<8);
_GPIOB_(GPIOX_CRH) |= (4+2+1)<<8;
}

inline void pinB10_Output_AFPP_2()
{
_GPIOB_(GPIOX_CRH) &= ~((4+1)<<8);
_GPIOB_(GPIOX_CRH) |= (8+2)<<8;
}

inline void pinB10_Output_AFPP_10()
{
_GPIOB_(GPIOX_CRH) &= ~((4+2)<<8);
_GPIOB_(GPIOX_CRH) |= (8+1)<<8;
}

inline void pinB10_Output_AFPP_50()
{
_GPIOB_(GPIOX_CRH) &= ~((4)<<8);
_GPIOB_(GPIOX_CRH) |= (8+2+1)<<8;
}

