Ontaelio/STM32F103-Ublink-framework/stm32f103_gpio_func.h
inline void pinB10_Output_AFOD_2()
{
_GPIOB_(GPIOX_CRH) &= ~((1)<<8);
_GPIOB_(GPIOX_CRH) |= (8+2+4)<<8;
}

inline void pinB10_Output_AFOD_10()
{
_GPIOB_(GPIOX_CRH) &= ~((2)<<8);
_GPIOB_(GPIOX_CRH) |= (8+4+1)<<8;
}

inline void pinB10_Output_AFOD_50()
{
_GPIOB_(GPIOX_CRH) |= (8+4+2+1)<<8;
}

inline void pinB11_Input()
{
_GPIOB_(GPIOX_CRH) &= ~((8+2+1)<<12);
_GPIOB_(GPIOX_CRH) |= (4)<<12;
}

inline void pinB11_Input_PU()
{
_GPIOB_(GPIOX_CRH) &= ~((4+2+1)<<12);
_GPIOB_(GPIOX_CRH) |= (8)<<12;
_GPIOB_(GPIOX_ODR) |= (1)<<3;
}

inline void pinB11_Input_PD()
{
_GPIOB_(GPIOX_CRH) &= ~((4+2+1)<<12);
_GPIOB_(GPIOX_CRH) |= (8)<<12;
_GPIOB_(GPIOX_ODR) &= ~(1<<3);
}

inline void pinB11_Analog()
{
_GPIOB_(GPIOX_CRH) &= ~((8+4+2+1)<<12);
}

inline void pinB11_Output()
{
_GPIOB_(GPIOX_CRH) &= ~((8+4+1)<<12);
_GPIOB_(GPIOX_CRH) |= (2)<<12;
}

inline void pinB11_Output_OD()
{
_GPIOB_(GPIOX_CRH) &= ~((8+1)<<12);
_GPIOB_(GPIOX_CRH) |= (2+4)<<12;
}

inline void pinB11_Output_PP_2()
{
_GPIOB_(GPIOX_CRH) &= ~((8+4+1)<<12);
_GPIOB_(GPIOX_CRH) |= (2)<<12;
}

inline void pinB11_Output_PP_10()
{
_GPIOB_(GPIOX_CRH) &= ~((8+4+2)<<12);
_GPIOB_(GPIOX_CRH) |= (1)<<12;
}

inline void pinB11_Output_PP_50()
{
_GPIOB_(GPIOX_CRH) &= ~((8+4)<<12);
_GPIOB_(GPIOX_CRH) |= (2+1)<<12;
}

inline void pinB11_Output_OD_2()
{
_GPIOB_(GPIOX_CRH) &= ~((8+1)<<12);
_GPIOB_(GPIOX_CRH) |= (2+4)<<12;
}

inline void pinB11_Output_OD_10()
{
_GPIOB_(GPIOX_CRH) &= ~((8+2)<<12);
_GPIOB_(GPIOX_CRH) |= (4+1)<<12;
}

inline void pinB11_Output_OD_50()
{
_GPIOB_(GPIOX_CRH) &= ~((8)<<12);
_GPIOB_(GPIOX_CRH) |= (4+2+1)<<12;
}

inline void pinB11_Output_AFPP_2()
{
_GPIOB_(GPIOX_CRH) &= ~((4+1)<<12);
_GPIOB_(GPIOX_CRH) |= (8+2)<<12;
}

inline void pinB11_Output_AFPP_10()
{
_GPIOB_(GPIOX_CRH) &= ~((4+2)<<12);
_GPIOB_(GPIOX_CRH) |= (8+1)<<12;
}

inline void pinB11_Output_AFPP_50()
{
_GPIOB_(GPIOX_CRH) &= ~((4)<<12);
_GPIOB_(GPIOX_CRH) |= (8+2+1)<<12;
}

inline void pinB11_Output_AFOD_2()
{
_GPIOB_(GPIOX_CRH) &= ~((1)<<12);
_GPIOB_(GPIOX_CRH) |= (8+2+4)<<12;
}

inline void pinB11_Output_AFOD_10()
{
_GPIOB_(GPIOX_CRH) &= ~((2)<<12);
_GPIOB_(GPIOX_CRH) |= (8+4+1)<<12;
}

inline void pinB11_Output_AFOD_50()
{
_GPIOB_(GPIOX_CRH) |= (8+4+2+1)<<12;
}

inline void pinB12_Input()
{
_GPIOB_(GPIOX_CRH) &= ~((8+2+1)<<16);
_GPIOB_(GPIOX_CRH) |= (4)<<16;
}

inline void pinB12_Input_PU()
{
_GPIOB_(GPIOX_CRH) &= ~((4+2+1)<<16);
_GPIOB_(GPIOX_CRH) |= (8)<<16;
_GPIOB_(GPIOX_ODR) |= (1)<<4;
}

inline void pinB12_Input_PD()
{
_GPIOB_(GPIOX_CRH) &= ~((4+2+1)<<16);
_GPIOB_(GPIOX_CRH) |= (8)<<16;
_GPIOB_(GPIOX_ODR) &= ~(1<<4);
}

inline void pinB12_Analog()
{
_GPIOB_(GPIOX_CRH) &= ~((8+4+2+1)<<16);
}

inline void pinB12_Output()
{
_GPIOB_(GPIOX_CRH) &= ~((8+4+1)<<16);
_GPIOB_(GPIOX_CRH) |= (2)<<16;
}

inline void pinB12_Output_OD()
{
_GPIOB_(GPIOX_CRH) &= ~((8+1)<<16);
_GPIOB_(GPIOX_CRH) |= (2+4)<<16;
}

inline void pinB12_Output_PP_2()
{
_GPIOB_(GPIOX_CRH) &= ~((8+4+1)<<16);
_GPIOB_(GPIOX_CRH) |= (2)<<16;
}

inline void pinB12_Output_PP_10()
{
_GPIOB_(GPIOX_CRH) &= ~((8+4+2)<<16);
_GPIOB_(GPIOX_CRH) |= (1)<<16;
}

inline void pinB12_Output_PP_50()
{
_GPIOB_(GPIOX_CRH) &= ~((8+4)<<16);
_GPIOB_(GPIOX_CRH) |= (2+1)<<16;
}

inline void pinB12_Output_OD_2()
{
_GPIOB_(GPIOX_CRH) &= ~((8+1)<<16);
_GPIOB_(GPIOX_CRH) |= (2+4)<<16;
}

inline void pinB12_Output_OD_10()
{
_GPIOB_(GPIOX_CRH) &= ~((8+2)<<16);
_GPIOB_(GPIOX_CRH) |= (4+1)<<16;
}

inline void pinB12_Output_OD_50()
{
_GPIOB_(GPIOX_CRH) &= ~((8)<<16);
_GPIOB_(GPIOX_CRH) |= (4+2+1)<<16;
}

inline void pinB12_Output_AFPP_2()
{
_GPIOB_(GPIOX_CRH) &= ~((4+1)<<16);
_GPIOB_(GPIOX_CRH) |= (8+2)<<16;
}

inline void pinB12_Output_AFPP_10()
{
_GPIOB_(GPIOX_CRH) &= ~((4+2)<<16);
_GPIOB_(GPIOX_CRH) |= (8+1)<<16;
}

inline void pinB12_Output_AFPP_50()
{
_GPIOB_(GPIOX_CRH) &= ~((4)<<16);
_GPIOB_(GPIOX_CRH) |= (8+2+1)<<16;
}

inline void pinB12_Output_AFOD_2()
{
_GPIOB_(GPIOX_CRH) &= ~((1)<<16);
_GPIOB_(GPIOX_CRH) |= (8+2+4)<<16;
}

inline void pinB12_Output_AFOD_10()
{
_GPIOB_(GPIOX_CRH) &= ~((2)<<16);
_GPIOB_(GPIOX_CRH) |= (8+4+1)<<16;
}

inline void pinB12_Output_AFOD_50()
{
_GPIOB_(GPIOX_CRH) |= (8+4+2+1)<<16;
}

inline void pinB13_Input()
{
_GPIOB_(GPIOX_CRH) &= ~((8+2+1)<<20);
_GPIOB_(GPIOX_CRH) |= (4)<<20;
}

inline void pinB13_Input_PU()
{
_GPIOB_(GPIOX_CRH) &= ~((4+2+1)<<20);
_GPIOB_(GPIOX_CRH) |= (8)<<20;
_GPIOB_(GPIOX_ODR) |= (1)<<5;
}

inline void pinB13_Input_PD()
{
_GPIOB_(GPIOX_CRH) &= ~((4+2+1)<<20);
_GPIOB_(GPIOX_CRH) |= (8)<<20;
_GPIOB_(GPIOX_ODR) &= ~(1<<5);
}

inline void pinB13_Analog()
{
_GPIOB_(GPIOX_CRH) &= ~((8+4+2+1)<<20);
}

inline void pinB13_Output()
{
_GPIOB_(GPIOX_CRH) &= ~((8+4+1)<<20);
_GPIOB_(GPIOX_CRH) |= (2)<<20;
}

inline void pinB13_Output_OD()
{
_GPIOB_(GPIOX_CRH) &= ~((8+1)<<20);
_GPIOB_(GPIOX_CRH) |= (2+4)<<20;
}

inline void pinB13_Output_PP_2()
{
_GPIOB_(GPIOX_CRH) &= ~((8+4+1)<<20);
_GPIOB_(GPIOX_CRH) |= (2)<<20;
}

inline void pinB13_Output_PP_10()
{
_GPIOB_(GPIOX_CRH) &= ~((8+4+2)<<20);
_GPIOB_(GPIOX_CRH) |= (1)<<20;
}

inline void pinB13_Output_PP_50()
{
_GPIOB_(GPIOX_CRH) &= ~((8+4)<<20);
_GPIOB_(GPIOX_CRH) |= (2+1)<<20;
}

inline void pinB13_Output_OD_2()
{
_GPIOB_(GPIOX_CRH) &= ~((8+1)<<20);
_GPIOB_(GPIOX_CRH) |= (2+4)<<20;
}

inline void pinB13_Output_OD_10()
{
_GPIOB_(GPIOX_CRH) &= ~((8+2)<<20);
_GPIOB_(GPIOX_CRH) |= (4+1)<<20;
}

inline void pinB13_Output_OD_50()
{
_GPIOB_(GPIOX_CRH) &= ~((8)<<20);
_GPIOB_(GPIOX_CRH) |= (4+2+1)<<20;
}

inline void pinB13_Output_AFPP_2()
{
_GPIOB_(GPIOX_CRH) &= ~((4+1)<<20);
_GPIOB_(GPIOX_CRH) |= (8+2)<<20;
}

inline void pinB13_Output_AFPP_10()
{
_GPIOB_(GPIOX_CRH) &= ~((4+2)<<20);
_GPIOB_(GPIOX_CRH) |= (8+1)<<20;
}

inline void pinB13_Output_AFPP_50()
{
_GPIOB_(GPIOX_CRH) &= ~((4)<<20);
_GPIOB_(GPIOX_CRH) |= (8+2+1)<<20;
}

inline void pinB13_Output_AFOD_2()
{
_GPIOB_(GPIOX_CRH) &= ~((1)<<20);
_GPIOB_(GPIOX_CRH) |= (8+2+4)<<20;
}

inline void pinB13_Output_AFOD_10()
{
_GPIOB_(GPIOX_CRH) &= ~((2)<<20);
_GPIOB_(GPIOX_CRH) |= (8+4+1)<<20;
}

inline void pinB13_Output_AFOD_50()
{
_GPIOB_(GPIOX_CRH) |= (8+4+2+1)<<20;
}

inline void pinB14_Input()
{
_GPIOB_(GPIOX_CRH) &= ~((8+2+1)<<24);
_GPIOB_(GPIOX_CRH) |= (4)<<24;
}

