Ontaelio/STM32F103-Ublink-framework/stm32f103_gpio_func.h
inline void pinB14_Input_PU()
{
_GPIOB_(GPIOX_CRH) &= ~((4+2+1)<<24);
_GPIOB_(GPIOX_CRH) |= (8)<<24;
_GPIOB_(GPIOX_ODR) |= (1)<<6;
}

inline void pinB14_Input_PD()
{
_GPIOB_(GPIOX_CRH) &= ~((4+2+1)<<24);
_GPIOB_(GPIOX_CRH) |= (8)<<24;
_GPIOB_(GPIOX_ODR) &= ~(1<<6);
}

inline void pinB14_Analog()
{
_GPIOB_(GPIOX_CRH) &= ~((8+4+2+1)<<24);
}

inline void pinB14_Output()
{
_GPIOB_(GPIOX_CRH) &= ~((8+4+1)<<24);
_GPIOB_(GPIOX_CRH) |= (2)<<24;
}

inline void pinB14_Output_OD()
{
_GPIOB_(GPIOX_CRH) &= ~((8+1)<<24);
_GPIOB_(GPIOX_CRH) |= (2+4)<<24;
}

inline void pinB14_Output_PP_2()
{
_GPIOB_(GPIOX_CRH) &= ~((8+4+1)<<24);
_GPIOB_(GPIOX_CRH) |= (2)<<24;
}

inline void pinB14_Output_PP_10()
{
_GPIOB_(GPIOX_CRH) &= ~((8+4+2)<<24);
_GPIOB_(GPIOX_CRH) |= (1)<<24;
}

inline void pinB14_Output_PP_50()
{
_GPIOB_(GPIOX_CRH) &= ~((8+4)<<24);
_GPIOB_(GPIOX_CRH) |= (2+1)<<24;
}

inline void pinB14_Output_OD_2()
{
_GPIOB_(GPIOX_CRH) &= ~((8+1)<<24);
_GPIOB_(GPIOX_CRH) |= (2+4)<<24;
}

inline void pinB14_Output_OD_10()
{
_GPIOB_(GPIOX_CRH) &= ~((8+2)<<24);
_GPIOB_(GPIOX_CRH) |= (4+1)<<24;
}

inline void pinB14_Output_OD_50()
{
_GPIOB_(GPIOX_CRH) &= ~((8)<<24);
_GPIOB_(GPIOX_CRH) |= (4+2+1)<<24;
}

inline void pinB14_Output_AFPP_2()
{
_GPIOB_(GPIOX_CRH) &= ~((4+1)<<24);
_GPIOB_(GPIOX_CRH) |= (8+2)<<24;
}

inline void pinB14_Output_AFPP_10()
{
_GPIOB_(GPIOX_CRH) &= ~((4+2)<<24);
_GPIOB_(GPIOX_CRH) |= (8+1)<<24;
}

inline void pinB14_Output_AFPP_50()
{
_GPIOB_(GPIOX_CRH) &= ~((4)<<24);
_GPIOB_(GPIOX_CRH) |= (8+2+1)<<24;
}

inline void pinB14_Output_AFOD_2()
{
_GPIOB_(GPIOX_CRH) &= ~((1)<<24);
_GPIOB_(GPIOX_CRH) |= (8+2+4)<<24;
}

inline void pinB14_Output_AFOD_10()
{
_GPIOB_(GPIOX_CRH) &= ~((2)<<24);
_GPIOB_(GPIOX_CRH) |= (8+4+1)<<24;
}

inline void pinB14_Output_AFOD_50()
{
_GPIOB_(GPIOX_CRH) |= (8+4+2+1)<<24;
}

inline void pinB15_Input()
{
_GPIOB_(GPIOX_CRH) &= ~((8+2+1)<<28);
_GPIOB_(GPIOX_CRH) |= (4)<<28;
}

inline void pinB15_Input_PU()
{
_GPIOB_(GPIOX_CRH) &= ~((4+2+1)<<28);
_GPIOB_(GPIOX_CRH) |= (8)<<28;
_GPIOB_(GPIOX_ODR) |= (1)<<7;
}

inline void pinB15_Input_PD()
{
_GPIOB_(GPIOX_CRH) &= ~((4+2+1)<<28);
_GPIOB_(GPIOX_CRH) |= (8)<<28;
_GPIOB_(GPIOX_ODR) &= ~(1<<7);
}

inline void pinB15_Analog()
{
_GPIOB_(GPIOX_CRH) &= ~((8+4+2+1)<<28);
}

inline void pinB15_Output()
{
_GPIOB_(GPIOX_CRH) &= ~((8+4+1)<<28);
_GPIOB_(GPIOX_CRH) |= (2)<<28;
}

inline void pinB15_Output_OD()
{
_GPIOB_(GPIOX_CRH) &= ~((8+1)<<28);
_GPIOB_(GPIOX_CRH) |= (2+4)<<28;
}

inline void pinB15_Output_PP_2()
{
_GPIOB_(GPIOX_CRH) &= ~((8+4+1)<<28);
_GPIOB_(GPIOX_CRH) |= (2)<<28;
}

inline void pinB15_Output_PP_10()
{
_GPIOB_(GPIOX_CRH) &= ~((8+4+2)<<28);
_GPIOB_(GPIOX_CRH) |= (1)<<28;
}

inline void pinB15_Output_PP_50()
{
_GPIOB_(GPIOX_CRH) &= ~((8+4)<<28);
_GPIOB_(GPIOX_CRH) |= (2+1)<<28;
}

inline void pinB15_Output_OD_2()
{
_GPIOB_(GPIOX_CRH) &= ~((8+1)<<28);
_GPIOB_(GPIOX_CRH) |= (2+4)<<28;
}

inline void pinB15_Output_OD_10()
{
_GPIOB_(GPIOX_CRH) &= ~((8+2)<<28);
_GPIOB_(GPIOX_CRH) |= (4+1)<<28;
}

inline void pinB15_Output_OD_50()
{
_GPIOB_(GPIOX_CRH) &= ~((8)<<28);
_GPIOB_(GPIOX_CRH) |= (4+2+1)<<28;
}

inline void pinB15_Output_AFPP_2()
{
_GPIOB_(GPIOX_CRH) &= ~((4+1)<<28);
_GPIOB_(GPIOX_CRH) |= (8+2)<<28;
}

inline void pinB15_Output_AFPP_10()
{
_GPIOB_(GPIOX_CRH) &= ~((4+2)<<28);
_GPIOB_(GPIOX_CRH) |= (8+1)<<28;
}

inline void pinB15_Output_AFPP_50()
{
_GPIOB_(GPIOX_CRH) &= ~((4)<<28);
_GPIOB_(GPIOX_CRH) |= (8+2+1)<<28;
}

inline void pinB15_Output_AFOD_2()
{
_GPIOB_(GPIOX_CRH) &= ~((1)<<28);
_GPIOB_(GPIOX_CRH) |= (8+2+4)<<28;
}

inline void pinB15_Output_AFOD_10()
{
_GPIOB_(GPIOX_CRH) &= ~((2)<<28);
_GPIOB_(GPIOX_CRH) |= (8+4+1)<<28;
}

inline void pinB15_Output_AFOD_50()
{
_GPIOB_(GPIOX_CRH) |= (8+4+2+1)<<28;
}

inline uint8_t readPinB0()
{
return ((_GPIOB_(GPIOX_IDR)>>0) & 1);
}

inline void setPinB0()
{
_GPIOB_(GPIOX_BSRR) = (1<<0);
}

inline void resetPinB0()
{
_GPIOB_(GPIOX_BRR) = (1<<0);
}

inline uint8_t readPinB1()
{
return ((_GPIOB_(GPIOX_IDR)>>1) & 1);
}

inline void setPinB1()
{
_GPIOB_(GPIOX_BSRR) = (1<<1);
}

inline void resetPinB1()
{
_GPIOB_(GPIOX_BRR) = (1<<1);
}

inline uint8_t readPinB2()
{
return ((_GPIOB_(GPIOX_IDR)>>2) & 1);
}

inline void setPinB2()
{
_GPIOB_(GPIOX_BSRR) = (1<<2);
}

inline void resetPinB2()
{
_GPIOB_(GPIOX_BRR) = (1<<2);
}

inline uint8_t readPinB3()
{
return ((_GPIOB_(GPIOX_IDR)>>3) & 1);
}

inline void setPinB3()
{
_GPIOB_(GPIOX_BSRR) = (1<<3);
}

inline void resetPinB3()
{
_GPIOB_(GPIOX_BRR) = (1<<3);
}

inline uint8_t readPinB4()
{
return ((_GPIOB_(GPIOX_IDR)>>4) & 1);
}

inline void setPinB4()
{
_GPIOB_(GPIOX_BSRR) = (1<<4);
}

inline void resetPinB4()
{
_GPIOB_(GPIOX_BRR) = (1<<4);
}

inline uint8_t readPinB5()
{
return ((_GPIOB_(GPIOX_IDR)>>5) & 1);
}

inline void setPinB5()
{
_GPIOB_(GPIOX_BSRR) = (1<<5);
}

inline void resetPinB5()
{
_GPIOB_(GPIOX_BRR) = (1<<5);
}

inline uint8_t readPinB6()
{
return ((_GPIOB_(GPIOX_IDR)>>6) & 1);
}

inline void setPinB6()
{
_GPIOB_(GPIOX_BSRR) = (1<<6);
}

inline void resetPinB6()
{
_GPIOB_(GPIOX_BRR) = (1<<6);
}

inline uint8_t readPinB7()
{
return ((_GPIOB_(GPIOX_IDR)>>7) & 1);
}

inline void setPinB7()
{
_GPIOB_(GPIOX_BSRR) = (1<<7);
}

inline void resetPinB7()
{
_GPIOB_(GPIOX_BRR) = (1<<7);
}

inline uint8_t readPinB8()
{
return ((_GPIOB_(GPIOX_IDR)>>8) & 1);
}

inline void setPinB8()
{
_GPIOB_(GPIOX_BSRR) = (1<<8);
}

inline void resetPinB8()
{
_GPIOB_(GPIOX_BRR) = (1<<8);
}

inline uint8_t readPinB9()
{
return ((_GPIOB_(GPIOX_IDR)>>9) & 1);
}

inline void setPinB9()
{
_GPIOB_(GPIOX_BSRR) = (1<<9);
}

inline void resetPinB9()
{
_GPIOB_(GPIOX_BRR) = (1<<9);
}

inline uint8_t readPinB10()
{
return ((_GPIOB_(GPIOX_IDR)>>10) & 1);
}

inline void setPinB10()
{
_GPIOB_(GPIOX_BSRR) = (1<<10);
}

inline void resetPinB10()
{
_GPIOB_(GPIOX_BRR) = (1<<10);
}

inline uint8_t readPinB11()
{
return ((_GPIOB_(GPIOX_IDR)>>11) & 1);
}

inline void setPinB11()
{
_GPIOB_(GPIOX_BSRR) = (1<<11);
}

inline void resetPinB11()
{
_GPIOB_(GPIOX_BRR) = (1<<11);
}

inline uint8_t readPinB12()
{
return ((_GPIOB_(GPIOX_IDR)>>12) & 1);
}

inline void setPinB12()
{
_GPIOB_(GPIOX_BSRR) = (1<<12);
}

