Ontaelio/STM32F103-Ublink-framework/stm32f103_gpio_func.h
inline void resetPinB12()
{
_GPIOB_(GPIOX_BRR) = (1<<12);
}

inline uint8_t readPinB13()
{
return ((_GPIOB_(GPIOX_IDR)>>13) & 1);
}

inline void setPinB13()
{
_GPIOB_(GPIOX_BSRR) = (1<<13);
}

inline void resetPinB13()
{
_GPIOB_(GPIOX_BRR) = (1<<13);
}

inline uint8_t readPinB14()
{
return ((_GPIOB_(GPIOX_IDR)>>14) & 1);
}

inline void setPinB14()
{
_GPIOB_(GPIOX_BSRR) = (1<<14);
}

inline void resetPinB14()
{
_GPIOB_(GPIOX_BRR) = (1<<14);
}

inline uint8_t readPinB15()
{
return ((_GPIOB_(GPIOX_IDR)>>15) & 1);
}

inline void setPinB15()
{
_GPIOB_(GPIOX_BSRR) = (1<<15);
}

inline void resetPinB15()
{
_GPIOB_(GPIOX_BRR) = (1<<15);
}

inline void pinA0_Input()
{
_GPIOA_(GPIOX_CRL) &= ~((8+2+1)<<0);
_GPIOA_(GPIOX_CRL) |= (4)<<0;
}

inline void pinA0_Input_PU()
{
_GPIOA_(GPIOX_CRL) &= ~((4+2+1)<<0);
_GPIOA_(GPIOX_CRL) |= (8)<<0;
_GPIOA_(GPIOX_ODR) |= (1)<<0;
}

inline void pinA0_Input_PD()
{
_GPIOA_(GPIOX_CRL) &= ~((4+2+1)<<0);
_GPIOA_(GPIOX_CRL) |= (8)<<0;
_GPIOA_(GPIOX_ODR) &= ~(1<<0);
}

inline void pinA0_Analog()
{
_GPIOA_(GPIOX_CRL) &= ~((8+4+2+1)<<0);
}

inline void pinA0_Output()
{
_GPIOA_(GPIOX_CRL) &= ~((8+4+1)<<0);
_GPIOA_(GPIOX_CRL) |= (2)<<0;
}

inline void pinA0_Output_OD()
{
_GPIOA_(GPIOX_CRL) &= ~((8+1)<<0);
_GPIOA_(GPIOX_CRL) |= (2+4)<<0;
}

inline void pinA0_Output_PP_2()
{
_GPIOA_(GPIOX_CRL) &= ~((8+4+1)<<0);
_GPIOA_(GPIOX_CRL) |= (2)<<0;
}

inline void pinA0_Output_PP_10()
{
_GPIOA_(GPIOX_CRL) &= ~((8+4+2)<<0);
_GPIOA_(GPIOX_CRL) |= (1)<<0;
}

inline void pinA0_Output_PP_50()
{
_GPIOA_(GPIOX_CRL) &= ~((8+4)<<0);
_GPIOA_(GPIOX_CRL) |= (2+1)<<0;
}

inline void pinA0_Output_OD_2()
{
_GPIOA_(GPIOX_CRL) &= ~((8+1)<<0);
_GPIOA_(GPIOX_CRL) |= (2+4)<<0;
}

inline void pinA0_Output_OD_10()
{
_GPIOA_(GPIOX_CRL) &= ~((8+2)<<0);
_GPIOA_(GPIOX_CRL) |= (4+1)<<0;
}

inline void pinA0_Output_OD_50()
{
_GPIOA_(GPIOX_CRL) &= ~((8)<<0);
_GPIOA_(GPIOX_CRL) |= (4+2+1)<<0;
}

inline void pinA0_Output_AFPP_2()
{
_GPIOA_(GPIOX_CRL) &= ~((4+1)<<0);
_GPIOA_(GPIOX_CRL) |= (8+2)<<0;
}

inline void pinA0_Output_AFPP_10()
{
_GPIOA_(GPIOX_CRL) &= ~((4+2)<<0);
_GPIOA_(GPIOX_CRL) |= (8+1)<<0;
}

inline void pinA0_Output_AFPP_50()
{
_GPIOA_(GPIOX_CRL) &= ~((4)<<0);
_GPIOA_(GPIOX_CRL) |= (8+2+1)<<0;
}

inline void pinA0_Output_AFOD_2()
{
_GPIOA_(GPIOX_CRL) &= ~((1)<<0);
_GPIOA_(GPIOX_CRL) |= (8+2+4)<<0;
}

inline void pinA0_Output_AFOD_10()
{
_GPIOA_(GPIOX_CRL) &= ~((2)<<0);
_GPIOA_(GPIOX_CRL) |= (8+4+1)<<0;
}

inline void pinA0_Output_AFOD_50()
{
_GPIOA_(GPIOX_CRL) |= (8+4+2+1)<<0;
}

inline void pinA1_Input()
{
_GPIOA_(GPIOX_CRL) &= ~((8+2+1)<<4);
_GPIOA_(GPIOX_CRL) |= (4)<<4;
}

inline void pinA1_Input_PU()
{
_GPIOA_(GPIOX_CRL) &= ~((4+2+1)<<4);
_GPIOA_(GPIOX_CRL) |= (8)<<4;
_GPIOA_(GPIOX_ODR) |= (1)<<1;
}

inline void pinA1_Input_PD()
{
_GPIOA_(GPIOX_CRL) &= ~((4+2+1)<<4);
_GPIOA_(GPIOX_CRL) |= (8)<<4;
_GPIOA_(GPIOX_ODR) &= ~(1<<1);
}

inline void pinA1_Analog()
{
_GPIOA_(GPIOX_CRL) &= ~((8+4+2+1)<<4);
}

inline void pinA1_Output()
{
_GPIOA_(GPIOX_CRL) &= ~((8+4+1)<<4);
_GPIOA_(GPIOX_CRL) |= (2)<<4;
}

inline void pinA1_Output_OD()
{
_GPIOA_(GPIOX_CRL) &= ~((8+1)<<4);
_GPIOA_(GPIOX_CRL) |= (2+4)<<4;
}

inline void pinA1_Output_PP_2()
{
_GPIOA_(GPIOX_CRL) &= ~((8+4+1)<<4);
_GPIOA_(GPIOX_CRL) |= (2)<<4;
}

inline void pinA1_Output_PP_10()
{
_GPIOA_(GPIOX_CRL) &= ~((8+4+2)<<4);
_GPIOA_(GPIOX_CRL) |= (1)<<4;
}

inline void pinA1_Output_PP_50()
{
_GPIOA_(GPIOX_CRL) &= ~((8+4)<<4);
_GPIOA_(GPIOX_CRL) |= (2+1)<<4;
}

inline void pinA1_Output_OD_2()
{
_GPIOA_(GPIOX_CRL) &= ~((8+1)<<4);
_GPIOA_(GPIOX_CRL) |= (2+4)<<4;
}

inline void pinA1_Output_OD_10()
{
_GPIOA_(GPIOX_CRL) &= ~((8+2)<<4);
_GPIOA_(GPIOX_CRL) |= (4+1)<<4;
}

inline void pinA1_Output_OD_50()
{
_GPIOA_(GPIOX_CRL) &= ~((8)<<4);
_GPIOA_(GPIOX_CRL) |= (4+2+1)<<4;
}

inline void pinA1_Output_AFPP_2()
{
_GPIOA_(GPIOX_CRL) &= ~((4+1)<<4);
_GPIOA_(GPIOX_CRL) |= (8+2)<<4;
}

inline void pinA1_Output_AFPP_10()
{
_GPIOA_(GPIOX_CRL) &= ~((4+2)<<4);
_GPIOA_(GPIOX_CRL) |= (8+1)<<4;
}

inline void pinA1_Output_AFPP_50()
{
_GPIOA_(GPIOX_CRL) &= ~((4)<<4);
_GPIOA_(GPIOX_CRL) |= (8+2+1)<<4;
}

inline void pinA1_Output_AFOD_2()
{
_GPIOA_(GPIOX_CRL) &= ~((1)<<4);
_GPIOA_(GPIOX_CRL) |= (8+2+4)<<4;
}

inline void pinA1_Output_AFOD_10()
{
_GPIOA_(GPIOX_CRL) &= ~((2)<<4);
_GPIOA_(GPIOX_CRL) |= (8+4+1)<<4;
}

inline void pinA1_Output_AFOD_50()
{
_GPIOA_(GPIOX_CRL) |= (8+4+2+1)<<4;
}

inline void pinA2_Input()
{
_GPIOA_(GPIOX_CRL) &= ~((8+2+1)<<8);
_GPIOA_(GPIOX_CRL) |= (4)<<8;
}

inline void pinA2_Input_PU()
{
_GPIOA_(GPIOX_CRL) &= ~((4+2+1)<<8);
_GPIOA_(GPIOX_CRL) |= (8)<<8;
_GPIOA_(GPIOX_ODR) |= (1)<<2;
}

inline void pinA2_Input_PD()
{
_GPIOA_(GPIOX_CRL) &= ~((4+2+1)<<8);
_GPIOA_(GPIOX_CRL) |= (8)<<8;
_GPIOA_(GPIOX_ODR) &= ~(1<<2);
}

inline void pinA2_Analog()
{
_GPIOA_(GPIOX_CRL) &= ~((8+4+2+1)<<8);
}

inline void pinA2_Output()
{
_GPIOA_(GPIOX_CRL) &= ~((8+4+1)<<8);
_GPIOA_(GPIOX_CRL) |= (2)<<8;
}

inline void pinA2_Output_OD()
{
_GPIOA_(GPIOX_CRL) &= ~((8+1)<<8);
_GPIOA_(GPIOX_CRL) |= (2+4)<<8;
}

inline void pinA2_Output_PP_2()
{
_GPIOA_(GPIOX_CRL) &= ~((8+4+1)<<8);
_GPIOA_(GPIOX_CRL) |= (2)<<8;
}

inline void pinA2_Output_PP_10()
{
_GPIOA_(GPIOX_CRL) &= ~((8+4+2)<<8);
_GPIOA_(GPIOX_CRL) |= (1)<<8;
}

inline void pinA2_Output_PP_50()
{
_GPIOA_(GPIOX_CRL) &= ~((8+4)<<8);
_GPIOA_(GPIOX_CRL) |= (2+1)<<8;
}

inline void pinA2_Output_OD_2()
{
_GPIOA_(GPIOX_CRL) &= ~((8+1)<<8);
_GPIOA_(GPIOX_CRL) |= (2+4)<<8;
}

inline void pinA2_Output_OD_10()
{
_GPIOA_(GPIOX_CRL) &= ~((8+2)<<8);
_GPIOA_(GPIOX_CRL) |= (4+1)<<8;
}

inline void pinA2_Output_OD_50()
{
_GPIOA_(GPIOX_CRL) &= ~((8)<<8);
_GPIOA_(GPIOX_CRL) |= (4+2+1)<<8;
}

inline void pinA2_Output_AFPP_2()
{
_GPIOA_(GPIOX_CRL) &= ~((4+1)<<8);
_GPIOA_(GPIOX_CRL) |= (8+2)<<8;
}

inline void pinA2_Output_AFPP_10()
{
_GPIOA_(GPIOX_CRL) &= ~((4+2)<<8);
_GPIOA_(GPIOX_CRL) |= (8+1)<<8;
}

inline void pinA2_Output_AFPP_50()
{
_GPIOA_(GPIOX_CRL) &= ~((4)<<8);
_GPIOA_(GPIOX_CRL) |= (8+2+1)<<8;
}

inline void pinA2_Output_AFOD_2()
{
_GPIOA_(GPIOX_CRL) &= ~((1)<<8);
_GPIOA_(GPIOX_CRL) |= (8+2+4)<<8;
}

inline void pinA2_Output_AFOD_10()
{
_GPIOA_(GPIOX_CRL) &= ~((2)<<8);
_GPIOA_(GPIOX_CRL) |= (8+4+1)<<8;
}

inline void pinA2_Output_AFOD_50()
{
_GPIOA_(GPIOX_CRL) |= (8+4+2+1)<<8;
}

