Ontaelio/STM32F103-Ublink-framework/stm32f103_gpio_func.h
inline void pinA3_Input()
{
_GPIOA_(GPIOX_CRL) &= ~((8+2+1)<<12);
_GPIOA_(GPIOX_CRL) |= (4)<<12;
}

inline void pinA3_Input_PU()
{
_GPIOA_(GPIOX_CRL) &= ~((4+2+1)<<12);
_GPIOA_(GPIOX_CRL) |= (8)<<12;
_GPIOA_(GPIOX_ODR) |= (1)<<3;
}

inline void pinA3_Input_PD()
{
_GPIOA_(GPIOX_CRL) &= ~((4+2+1)<<12);
_GPIOA_(GPIOX_CRL) |= (8)<<12;
_GPIOA_(GPIOX_ODR) &= ~(1<<3);
}

inline void pinA3_Analog()
{
_GPIOA_(GPIOX_CRL) &= ~((8+4+2+1)<<12);
}

inline void pinA3_Output()
{
_GPIOA_(GPIOX_CRL) &= ~((8+4+1)<<12);
_GPIOA_(GPIOX_CRL) |= (2)<<12;
}

inline void pinA3_Output_OD()
{
_GPIOA_(GPIOX_CRL) &= ~((8+1)<<12);
_GPIOA_(GPIOX_CRL) |= (2+4)<<12;
}

inline void pinA3_Output_PP_2()
{
_GPIOA_(GPIOX_CRL) &= ~((8+4+1)<<12);
_GPIOA_(GPIOX_CRL) |= (2)<<12;
}

inline void pinA3_Output_PP_10()
{
_GPIOA_(GPIOX_CRL) &= ~((8+4+2)<<12);
_GPIOA_(GPIOX_CRL) |= (1)<<12;
}

inline void pinA3_Output_PP_50()
{
_GPIOA_(GPIOX_CRL) &= ~((8+4)<<12);
_GPIOA_(GPIOX_CRL) |= (2+1)<<12;
}

inline void pinA3_Output_OD_2()
{
_GPIOA_(GPIOX_CRL) &= ~((8+1)<<12);
_GPIOA_(GPIOX_CRL) |= (2+4)<<12;
}

inline void pinA3_Output_OD_10()
{
_GPIOA_(GPIOX_CRL) &= ~((8+2)<<12);
_GPIOA_(GPIOX_CRL) |= (4+1)<<12;
}

inline void pinA3_Output_OD_50()
{
_GPIOA_(GPIOX_CRL) &= ~((8)<<12);
_GPIOA_(GPIOX_CRL) |= (4+2+1)<<12;
}

inline void pinA3_Output_AFPP_2()
{
_GPIOA_(GPIOX_CRL) &= ~((4+1)<<12);
_GPIOA_(GPIOX_CRL) |= (8+2)<<12;
}

inline void pinA3_Output_AFPP_10()
{
_GPIOA_(GPIOX_CRL) &= ~((4+2)<<12);
_GPIOA_(GPIOX_CRL) |= (8+1)<<12;
}

inline void pinA3_Output_AFPP_50()
{
_GPIOA_(GPIOX_CRL) &= ~((4)<<12);
_GPIOA_(GPIOX_CRL) |= (8+2+1)<<12;
}

inline void pinA3_Output_AFOD_2()
{
_GPIOA_(GPIOX_CRL) &= ~((1)<<12);
_GPIOA_(GPIOX_CRL) |= (8+2+4)<<12;
}

inline void pinA3_Output_AFOD_10()
{
_GPIOA_(GPIOX_CRL) &= ~((2)<<12);
_GPIOA_(GPIOX_CRL) |= (8+4+1)<<12;
}

inline void pinA3_Output_AFOD_50()
{
_GPIOA_(GPIOX_CRL) |= (8+4+2+1)<<12;
}

inline void pinA4_Input()
{
_GPIOA_(GPIOX_CRL) &= ~((8+2+1)<<16);
_GPIOA_(GPIOX_CRL) |= (4)<<16;
}

inline void pinA4_Input_PU()
{
_GPIOA_(GPIOX_CRL) &= ~((4+2+1)<<16);
_GPIOA_(GPIOX_CRL) |= (8)<<16;
_GPIOA_(GPIOX_ODR) |= (1)<<4;
}

inline void pinA4_Input_PD()
{
_GPIOA_(GPIOX_CRL) &= ~((4+2+1)<<16);
_GPIOA_(GPIOX_CRL) |= (8)<<16;
_GPIOA_(GPIOX_ODR) &= ~(1<<4);
}

inline void pinA4_Analog()
{
_GPIOA_(GPIOX_CRL) &= ~((8+4+2+1)<<16);
}

inline void pinA4_Output()
{
_GPIOA_(GPIOX_CRL) &= ~((8+4+1)<<16);
_GPIOA_(GPIOX_CRL) |= (2)<<16;
}

inline void pinA4_Output_OD()
{
_GPIOA_(GPIOX_CRL) &= ~((8+1)<<16);
_GPIOA_(GPIOX_CRL) |= (2+4)<<16;
}

inline void pinA4_Output_PP_2()
{
_GPIOA_(GPIOX_CRL) &= ~((8+4+1)<<16);
_GPIOA_(GPIOX_CRL) |= (2)<<16;
}

inline void pinA4_Output_PP_10()
{
_GPIOA_(GPIOX_CRL) &= ~((8+4+2)<<16);
_GPIOA_(GPIOX_CRL) |= (1)<<16;
}

inline void pinA4_Output_PP_50()
{
_GPIOA_(GPIOX_CRL) &= ~((8+4)<<16);
_GPIOA_(GPIOX_CRL) |= (2+1)<<16;
}

inline void pinA4_Output_OD_2()
{
_GPIOA_(GPIOX_CRL) &= ~((8+1)<<16);
_GPIOA_(GPIOX_CRL) |= (2+4)<<16;
}

inline void pinA4_Output_OD_10()
{
_GPIOA_(GPIOX_CRL) &= ~((8+2)<<16);
_GPIOA_(GPIOX_CRL) |= (4+1)<<16;
}

inline void pinA4_Output_OD_50()
{
_GPIOA_(GPIOX_CRL) &= ~((8)<<16);
_GPIOA_(GPIOX_CRL) |= (4+2+1)<<16;
}

inline void pinA4_Output_AFPP_2()
{
_GPIOA_(GPIOX_CRL) &= ~((4+1)<<16);
_GPIOA_(GPIOX_CRL) |= (8+2)<<16;
}

inline void pinA4_Output_AFPP_10()
{
_GPIOA_(GPIOX_CRL) &= ~((4+2)<<16);
_GPIOA_(GPIOX_CRL) |= (8+1)<<16;
}

inline void pinA4_Output_AFPP_50()
{
_GPIOA_(GPIOX_CRL) &= ~((4)<<16);
_GPIOA_(GPIOX_CRL) |= (8+2+1)<<16;
}

inline void pinA4_Output_AFOD_2()
{
_GPIOA_(GPIOX_CRL) &= ~((1)<<16);
_GPIOA_(GPIOX_CRL) |= (8+2+4)<<16;
}

inline void pinA4_Output_AFOD_10()
{
_GPIOA_(GPIOX_CRL) &= ~((2)<<16);
_GPIOA_(GPIOX_CRL) |= (8+4+1)<<16;
}

inline void pinA4_Output_AFOD_50()
{
_GPIOA_(GPIOX_CRL) |= (8+4+2+1)<<16;
}

inline void pinA5_Input()
{
_GPIOA_(GPIOX_CRL) &= ~((8+2+1)<<20);
_GPIOA_(GPIOX_CRL) |= (4)<<20;
}

inline void pinA5_Input_PU()
{
_GPIOA_(GPIOX_CRL) &= ~((4+2+1)<<20);
_GPIOA_(GPIOX_CRL) |= (8)<<20;
_GPIOA_(GPIOX_ODR) |= (1)<<5;
}

inline void pinA5_Input_PD()
{
_GPIOA_(GPIOX_CRL) &= ~((4+2+1)<<20);
_GPIOA_(GPIOX_CRL) |= (8)<<20;
_GPIOA_(GPIOX_ODR) &= ~(1<<5);
}

inline void pinA5_Analog()
{
_GPIOA_(GPIOX_CRL) &= ~((8+4+2+1)<<20);
}

inline void pinA5_Output()
{
_GPIOA_(GPIOX_CRL) &= ~((8+4+1)<<20);
_GPIOA_(GPIOX_CRL) |= (2)<<20;
}

inline void pinA5_Output_OD()
{
_GPIOA_(GPIOX_CRL) &= ~((8+1)<<20);
_GPIOA_(GPIOX_CRL) |= (2+4)<<20;
}

inline void pinA5_Output_PP_2()
{
_GPIOA_(GPIOX_CRL) &= ~((8+4+1)<<20);
_GPIOA_(GPIOX_CRL) |= (2)<<20;
}

inline void pinA5_Output_PP_10()
{
_GPIOA_(GPIOX_CRL) &= ~((8+4+2)<<20);
_GPIOA_(GPIOX_CRL) |= (1)<<20;
}

inline void pinA5_Output_PP_50()
{
_GPIOA_(GPIOX_CRL) &= ~((8+4)<<20);
_GPIOA_(GPIOX_CRL) |= (2+1)<<20;
}

inline void pinA5_Output_OD_2()
{
_GPIOA_(GPIOX_CRL) &= ~((8+1)<<20);
_GPIOA_(GPIOX_CRL) |= (2+4)<<20;
}

inline void pinA5_Output_OD_10()
{
_GPIOA_(GPIOX_CRL) &= ~((8+2)<<20);
_GPIOA_(GPIOX_CRL) |= (4+1)<<20;
}

inline void pinA5_Output_OD_50()
{
_GPIOA_(GPIOX_CRL) &= ~((8)<<20);
_GPIOA_(GPIOX_CRL) |= (4+2+1)<<20;
}

inline void pinA5_Output_AFPP_2()
{
_GPIOA_(GPIOX_CRL) &= ~((4+1)<<20);
_GPIOA_(GPIOX_CRL) |= (8+2)<<20;
}

inline void pinA5_Output_AFPP_10()
{
_GPIOA_(GPIOX_CRL) &= ~((4+2)<<20);
_GPIOA_(GPIOX_CRL) |= (8+1)<<20;
}

inline void pinA5_Output_AFPP_50()
{
_GPIOA_(GPIOX_CRL) &= ~((4)<<20);
_GPIOA_(GPIOX_CRL) |= (8+2+1)<<20;
}

inline void pinA5_Output_AFOD_2()
{
_GPIOA_(GPIOX_CRL) &= ~((1)<<20);
_GPIOA_(GPIOX_CRL) |= (8+2+4)<<20;
}

inline void pinA5_Output_AFOD_10()
{
_GPIOA_(GPIOX_CRL) &= ~((2)<<20);
_GPIOA_(GPIOX_CRL) |= (8+4+1)<<20;
}

inline void pinA5_Output_AFOD_50()
{
_GPIOA_(GPIOX_CRL) |= (8+4+2+1)<<20;
}

inline void pinA6_Input()
{
_GPIOA_(GPIOX_CRL) &= ~((8+2+1)<<24);
_GPIOA_(GPIOX_CRL) |= (4)<<24;
}

inline void pinA6_Input_PU()
{
_GPIOA_(GPIOX_CRL) &= ~((4+2+1)<<24);
_GPIOA_(GPIOX_CRL) |= (8)<<24;
_GPIOA_(GPIOX_ODR) |= (1)<<6;
}

inline void pinA6_Input_PD()
{
_GPIOA_(GPIOX_CRL) &= ~((4+2+1)<<24);
_GPIOA_(GPIOX_CRL) |= (8)<<24;
_GPIOA_(GPIOX_ODR) &= ~(1<<6);
}

