Ontaelio/STM32F103-Ublink-framework/stm32f103_gpio_func.h
inline void pinA6_Analog()
{
_GPIOA_(GPIOX_CRL) &= ~((8+4+2+1)<<24);
}

inline void pinA6_Output()
{
_GPIOA_(GPIOX_CRL) &= ~((8+4+1)<<24);
_GPIOA_(GPIOX_CRL) |= (2)<<24;
}

inline void pinA6_Output_OD()
{
_GPIOA_(GPIOX_CRL) &= ~((8+1)<<24);
_GPIOA_(GPIOX_CRL) |= (2+4)<<24;
}

inline void pinA6_Output_PP_2()
{
_GPIOA_(GPIOX_CRL) &= ~((8+4+1)<<24);
_GPIOA_(GPIOX_CRL) |= (2)<<24;
}

inline void pinA6_Output_PP_10()
{
_GPIOA_(GPIOX_CRL) &= ~((8+4+2)<<24);
_GPIOA_(GPIOX_CRL) |= (1)<<24;
}

inline void pinA6_Output_PP_50()
{
_GPIOA_(GPIOX_CRL) &= ~((8+4)<<24);
_GPIOA_(GPIOX_CRL) |= (2+1)<<24;
}

inline void pinA6_Output_OD_2()
{
_GPIOA_(GPIOX_CRL) &= ~((8+1)<<24);
_GPIOA_(GPIOX_CRL) |= (2+4)<<24;
}

inline void pinA6_Output_OD_10()
{
_GPIOA_(GPIOX_CRL) &= ~((8+2)<<24);
_GPIOA_(GPIOX_CRL) |= (4+1)<<24;
}

inline void pinA6_Output_OD_50()
{
_GPIOA_(GPIOX_CRL) &= ~((8)<<24);
_GPIOA_(GPIOX_CRL) |= (4+2+1)<<24;
}

inline void pinA6_Output_AFPP_2()
{
_GPIOA_(GPIOX_CRL) &= ~((4+1)<<24);
_GPIOA_(GPIOX_CRL) |= (8+2)<<24;
}

inline void pinA6_Output_AFPP_10()
{
_GPIOA_(GPIOX_CRL) &= ~((4+2)<<24);
_GPIOA_(GPIOX_CRL) |= (8+1)<<24;
}

inline void pinA6_Output_AFPP_50()
{
_GPIOA_(GPIOX_CRL) &= ~((4)<<24);
_GPIOA_(GPIOX_CRL) |= (8+2+1)<<24;
}

inline void pinA6_Output_AFOD_2()
{
_GPIOA_(GPIOX_CRL) &= ~((1)<<24);
_GPIOA_(GPIOX_CRL) |= (8+2+4)<<24;
}

inline void pinA6_Output_AFOD_10()
{
_GPIOA_(GPIOX_CRL) &= ~((2)<<24);
_GPIOA_(GPIOX_CRL) |= (8+4+1)<<24;
}

inline void pinA6_Output_AFOD_50()
{
_GPIOA_(GPIOX_CRL) |= (8+4+2+1)<<24;
}

inline void pinA7_Input()
{
_GPIOA_(GPIOX_CRL) &= ~((8+2+1)<<28);
_GPIOA_(GPIOX_CRL) |= (4)<<28;
}

inline void pinA7_Input_PU()
{
_GPIOA_(GPIOX_CRL) &= ~((4+2+1)<<28);
_GPIOA_(GPIOX_CRL) |= (8)<<28;
_GPIOA_(GPIOX_ODR) |= (1)<<7;
}

inline void pinA7_Input_PD()
{
_GPIOA_(GPIOX_CRL) &= ~((4+2+1)<<28);
_GPIOA_(GPIOX_CRL) |= (8)<<28;
_GPIOA_(GPIOX_ODR) &= ~(1<<7);
}

inline void pinA7_Analog()
{
_GPIOA_(GPIOX_CRL) &= ~((8+4+2+1)<<28);
}

inline void pinA7_Output()
{
_GPIOA_(GPIOX_CRL) &= ~((8+4+1)<<28);
_GPIOA_(GPIOX_CRL) |= (2)<<28;
}

inline void pinA7_Output_OD()
{
_GPIOA_(GPIOX_CRL) &= ~((8+1)<<28);
_GPIOA_(GPIOX_CRL) |= (2+4)<<28;
}

inline void pinA7_Output_PP_2()
{
_GPIOA_(GPIOX_CRL) &= ~((8+4+1)<<28);
_GPIOA_(GPIOX_CRL) |= (2)<<28;
}

inline void pinA7_Output_PP_10()
{
_GPIOA_(GPIOX_CRL) &= ~((8+4+2)<<28);
_GPIOA_(GPIOX_CRL) |= (1)<<28;
}

inline void pinA7_Output_PP_50()
{
_GPIOA_(GPIOX_CRL) &= ~((8+4)<<28);
_GPIOA_(GPIOX_CRL) |= (2+1)<<28;
}

inline void pinA7_Output_OD_2()
{
_GPIOA_(GPIOX_CRL) &= ~((8+1)<<28);
_GPIOA_(GPIOX_CRL) |= (2+4)<<28;
}

inline void pinA7_Output_OD_10()
{
_GPIOA_(GPIOX_CRL) &= ~((8+2)<<28);
_GPIOA_(GPIOX_CRL) |= (4+1)<<28;
}

inline void pinA7_Output_OD_50()
{
_GPIOA_(GPIOX_CRL) &= ~((8)<<28);
_GPIOA_(GPIOX_CRL) |= (4+2+1)<<28;
}

inline void pinA7_Output_AFPP_2()
{
_GPIOA_(GPIOX_CRL) &= ~((4+1)<<28);
_GPIOA_(GPIOX_CRL) |= (8+2)<<28;
}

inline void pinA7_Output_AFPP_10()
{
_GPIOA_(GPIOX_CRL) &= ~((4+2)<<28);
_GPIOA_(GPIOX_CRL) |= (8+1)<<28;
}

inline void pinA7_Output_AFPP_50()
{
_GPIOA_(GPIOX_CRL) &= ~((4)<<28);
_GPIOA_(GPIOX_CRL) |= (8+2+1)<<28;
}

inline void pinA7_Output_AFOD_2()
{
_GPIOA_(GPIOX_CRL) &= ~((1)<<28);
_GPIOA_(GPIOX_CRL) |= (8+2+4)<<28;
}

inline void pinA7_Output_AFOD_10()
{
_GPIOA_(GPIOX_CRL) &= ~((2)<<28);
_GPIOA_(GPIOX_CRL) |= (8+4+1)<<28;
}

inline void pinA7_Output_AFOD_50()
{
_GPIOA_(GPIOX_CRL) |= (8+4+2+1)<<28;
}

inline void pinA8_Input()
{
_GPIOA_(GPIOX_CRH) &= ~((8+2+1)<<0);
_GPIOA_(GPIOX_CRH) |= (4)<<0;
}

inline void pinA8_Input_PU()
{
_GPIOA_(GPIOX_CRH) &= ~((4+2+1)<<0);
_GPIOA_(GPIOX_CRH) |= (8)<<0;
_GPIOA_(GPIOX_ODR) |= (1)<<0;
}

inline void pinA8_Input_PD()
{
_GPIOA_(GPIOX_CRH) &= ~((4+2+1)<<0);
_GPIOA_(GPIOX_CRH) |= (8)<<0;
_GPIOA_(GPIOX_ODR) &= ~(1<<0);
}

inline void pinA8_Analog()
{
_GPIOA_(GPIOX_CRH) &= ~((8+4+2+1)<<0);
}

inline void pinA8_Output()
{
_GPIOA_(GPIOX_CRH) &= ~((8+4+1)<<0);
_GPIOA_(GPIOX_CRH) |= (2)<<0;
}

inline void pinA8_Output_OD()
{
_GPIOA_(GPIOX_CRH) &= ~((8+1)<<0);
_GPIOA_(GPIOX_CRH) |= (2+4)<<0;
}

inline void pinA8_Output_PP_2()
{
_GPIOA_(GPIOX_CRH) &= ~((8+4+1)<<0);
_GPIOA_(GPIOX_CRH) |= (2)<<0;
}

inline void pinA8_Output_PP_10()
{
_GPIOA_(GPIOX_CRH) &= ~((8+4+2)<<0);
_GPIOA_(GPIOX_CRH) |= (1)<<0;
}

inline void pinA8_Output_PP_50()
{
_GPIOA_(GPIOX_CRH) &= ~((8+4)<<0);
_GPIOA_(GPIOX_CRH) |= (2+1)<<0;
}

inline void pinA8_Output_OD_2()
{
_GPIOA_(GPIOX_CRH) &= ~((8+1)<<0);
_GPIOA_(GPIOX_CRH) |= (2+4)<<0;
}

inline void pinA8_Output_OD_10()
{
_GPIOA_(GPIOX_CRH) &= ~((8+2)<<0);
_GPIOA_(GPIOX_CRH) |= (4+1)<<0;
}

inline void pinA8_Output_OD_50()
{
_GPIOA_(GPIOX_CRH) &= ~((8)<<0);
_GPIOA_(GPIOX_CRH) |= (4+2+1)<<0;
}

inline void pinA8_Output_AFPP_2()
{
_GPIOA_(GPIOX_CRH) &= ~((4+1)<<0);
_GPIOA_(GPIOX_CRH) |= (8+2)<<0;
}

inline void pinA8_Output_AFPP_10()
{
_GPIOA_(GPIOX_CRH) &= ~((4+2)<<0);
_GPIOA_(GPIOX_CRH) |= (8+1)<<0;
}

inline void pinA8_Output_AFPP_50()
{
_GPIOA_(GPIOX_CRH) &= ~((4)<<0);
_GPIOA_(GPIOX_CRH) |= (8+2+1)<<0;
}

inline void pinA8_Output_AFOD_2()
{
_GPIOA_(GPIOX_CRH) &= ~((1)<<0);
_GPIOA_(GPIOX_CRH) |= (8+2+4)<<0;
}

inline void pinA8_Output_AFOD_10()
{
_GPIOA_(GPIOX_CRH) &= ~((2)<<0);
_GPIOA_(GPIOX_CRH) |= (8+4+1)<<0;
}

inline void pinA8_Output_AFOD_50()
{
_GPIOA_(GPIOX_CRH) |= (8+4+2+1)<<0;
}

inline void pinA9_Input()
{
_GPIOA_(GPIOX_CRH) &= ~((8+2+1)<<4);
_GPIOA_(GPIOX_CRH) |= (4)<<4;
}

inline void pinA9_Input_PU()
{
_GPIOA_(GPIOX_CRH) &= ~((4+2+1)<<4);
_GPIOA_(GPIOX_CRH) |= (8)<<4;
_GPIOA_(GPIOX_ODR) |= (1)<<1;
}

inline void pinA9_Input_PD()
{
_GPIOA_(GPIOX_CRH) &= ~((4+2+1)<<4);
_GPIOA_(GPIOX_CRH) |= (8)<<4;
_GPIOA_(GPIOX_ODR) &= ~(1<<1);
}

inline void pinA9_Analog()
{
_GPIOA_(GPIOX_CRH) &= ~((8+4+2+1)<<4);
}

inline void pinA9_Output()
{
_GPIOA_(GPIOX_CRH) &= ~((8+4+1)<<4);
_GPIOA_(GPIOX_CRH) |= (2)<<4;
}

inline void pinA9_Output_OD()
{
_GPIOA_(GPIOX_CRH) &= ~((8+1)<<4);
_GPIOA_(GPIOX_CRH) |= (2+4)<<4;
}

inline void pinA9_Output_PP_2()
{
_GPIOA_(GPIOX_CRH) &= ~((8+4+1)<<4);
_GPIOA_(GPIOX_CRH) |= (2)<<4;
}

inline void pinA9_Output_PP_10()
{
_GPIOA_(GPIOX_CRH) &= ~((8+4+2)<<4);
_GPIOA_(GPIOX_CRH) |= (1)<<4;
}

inline void pinA9_Output_PP_50()
{
_GPIOA_(GPIOX_CRH) &= ~((8+4)<<4);
_GPIOA_(GPIOX_CRH) |= (2+1)<<4;
}

inline void pinA9_Output_OD_2()
{
_GPIOA_(GPIOX_CRH) &= ~((8+1)<<4);
_GPIOA_(GPIOX_CRH) |= (2+4)<<4;
}

inline void pinA9_Output_OD_10()
{
_GPIOA_(GPIOX_CRH) &= ~((8+2)<<4);
_GPIOA_(GPIOX_CRH) |= (4+1)<<4;
}

