Ontaelio/STM32F103-Ublink-framework/stm32f103_gpio_func.h
inline void pinA9_Output_OD_50()
{
_GPIOA_(GPIOX_CRH) &= ~((8)<<4);
_GPIOA_(GPIOX_CRH) |= (4+2+1)<<4;
}

inline void pinA9_Output_AFPP_2()
{
_GPIOA_(GPIOX_CRH) &= ~((4+1)<<4);
_GPIOA_(GPIOX_CRH) |= (8+2)<<4;
}

inline void pinA9_Output_AFPP_10()
{
_GPIOA_(GPIOX_CRH) &= ~((4+2)<<4);
_GPIOA_(GPIOX_CRH) |= (8+1)<<4;
}

inline void pinA9_Output_AFPP_50()
{
_GPIOA_(GPIOX_CRH) &= ~((4)<<4);
_GPIOA_(GPIOX_CRH) |= (8+2+1)<<4;
}

inline void pinA9_Output_AFOD_2()
{
_GPIOA_(GPIOX_CRH) &= ~((1)<<4);
_GPIOA_(GPIOX_CRH) |= (8+2+4)<<4;
}

inline void pinA9_Output_AFOD_10()
{
_GPIOA_(GPIOX_CRH) &= ~((2)<<4);
_GPIOA_(GPIOX_CRH) |= (8+4+1)<<4;
}

inline void pinA9_Output_AFOD_50()
{
_GPIOA_(GPIOX_CRH) |= (8+4+2+1)<<4;
}

inline void pinA10_Input()
{
_GPIOA_(GPIOX_CRH) &= ~((8+2+1)<<8);
_GPIOA_(GPIOX_CRH) |= (4)<<8;
}

inline void pinA10_Input_PU()
{
_GPIOA_(GPIOX_CRH) &= ~((4+2+1)<<8);
_GPIOA_(GPIOX_CRH) |= (8)<<8;
_GPIOA_(GPIOX_ODR) |= (1)<<2;
}

inline void pinA10_Input_PD()
{
_GPIOA_(GPIOX_CRH) &= ~((4+2+1)<<8);
_GPIOA_(GPIOX_CRH) |= (8)<<8;
_GPIOA_(GPIOX_ODR) &= ~(1<<2);
}

inline void pinA10_Analog()
{
_GPIOA_(GPIOX_CRH) &= ~((8+4+2+1)<<8);
}

inline void pinA10_Output()
{
_GPIOA_(GPIOX_CRH) &= ~((8+4+1)<<8);
_GPIOA_(GPIOX_CRH) |= (2)<<8;
}

inline void pinA10_Output_OD()
{
_GPIOA_(GPIOX_CRH) &= ~((8+1)<<8);
_GPIOA_(GPIOX_CRH) |= (2+4)<<8;
}

inline void pinA10_Output_PP_2()
{
_GPIOA_(GPIOX_CRH) &= ~((8+4+1)<<8);
_GPIOA_(GPIOX_CRH) |= (2)<<8;
}

inline void pinA10_Output_PP_10()
{
_GPIOA_(GPIOX_CRH) &= ~((8+4+2)<<8);
_GPIOA_(GPIOX_CRH) |= (1)<<8;
}

inline void pinA10_Output_PP_50()
{
_GPIOA_(GPIOX_CRH) &= ~((8+4)<<8);
_GPIOA_(GPIOX_CRH) |= (2+1)<<8;
}

inline void pinA10_Output_OD_2()
{
_GPIOA_(GPIOX_CRH) &= ~((8+1)<<8);
_GPIOA_(GPIOX_CRH) |= (2+4)<<8;
}

inline void pinA10_Output_OD_10()
{
_GPIOA_(GPIOX_CRH) &= ~((8+2)<<8);
_GPIOA_(GPIOX_CRH) |= (4+1)<<8;
}

inline void pinA10_Output_OD_50()
{
_GPIOA_(GPIOX_CRH) &= ~((8)<<8);
_GPIOA_(GPIOX_CRH) |= (4+2+1)<<8;
}

inline void pinA10_Output_AFPP_2()
{
_GPIOA_(GPIOX_CRH) &= ~((4+1)<<8);
_GPIOA_(GPIOX_CRH) |= (8+2)<<8;
}

inline void pinA10_Output_AFPP_10()
{
_GPIOA_(GPIOX_CRH) &= ~((4+2)<<8);
_GPIOA_(GPIOX_CRH) |= (8+1)<<8;
}

inline void pinA10_Output_AFPP_50()
{
_GPIOA_(GPIOX_CRH) &= ~((4)<<8);
_GPIOA_(GPIOX_CRH) |= (8+2+1)<<8;
}

inline void pinA10_Output_AFOD_2()
{
_GPIOA_(GPIOX_CRH) &= ~((1)<<8);
_GPIOA_(GPIOX_CRH) |= (8+2+4)<<8;
}

inline void pinA10_Output_AFOD_10()
{
_GPIOA_(GPIOX_CRH) &= ~((2)<<8);
_GPIOA_(GPIOX_CRH) |= (8+4+1)<<8;
}

inline void pinA10_Output_AFOD_50()
{
_GPIOA_(GPIOX_CRH) |= (8+4+2+1)<<8;
}

inline void pinA11_Input()
{
_GPIOA_(GPIOX_CRH) &= ~((8+2+1)<<12);
_GPIOA_(GPIOX_CRH) |= (4)<<12;
}

inline void pinA11_Input_PU()
{
_GPIOA_(GPIOX_CRH) &= ~((4+2+1)<<12);
_GPIOA_(GPIOX_CRH) |= (8)<<12;
_GPIOA_(GPIOX_ODR) |= (1)<<3;
}

inline void pinA11_Input_PD()
{
_GPIOA_(GPIOX_CRH) &= ~((4+2+1)<<12);
_GPIOA_(GPIOX_CRH) |= (8)<<12;
_GPIOA_(GPIOX_ODR) &= ~(1<<3);
}

inline void pinA11_Analog()
{
_GPIOA_(GPIOX_CRH) &= ~((8+4+2+1)<<12);
}

inline void pinA11_Output()
{
_GPIOA_(GPIOX_CRH) &= ~((8+4+1)<<12);
_GPIOA_(GPIOX_CRH) |= (2)<<12;
}

inline void pinA11_Output_OD()
{
_GPIOA_(GPIOX_CRH) &= ~((8+1)<<12);
_GPIOA_(GPIOX_CRH) |= (2+4)<<12;
}

inline void pinA11_Output_PP_2()
{
_GPIOA_(GPIOX_CRH) &= ~((8+4+1)<<12);
_GPIOA_(GPIOX_CRH) |= (2)<<12;
}

inline void pinA11_Output_PP_10()
{
_GPIOA_(GPIOX_CRH) &= ~((8+4+2)<<12);
_GPIOA_(GPIOX_CRH) |= (1)<<12;
}

inline void pinA11_Output_PP_50()
{
_GPIOA_(GPIOX_CRH) &= ~((8+4)<<12);
_GPIOA_(GPIOX_CRH) |= (2+1)<<12;
}

inline void pinA11_Output_OD_2()
{
_GPIOA_(GPIOX_CRH) &= ~((8+1)<<12);
_GPIOA_(GPIOX_CRH) |= (2+4)<<12;
}

inline void pinA11_Output_OD_10()
{
_GPIOA_(GPIOX_CRH) &= ~((8+2)<<12);
_GPIOA_(GPIOX_CRH) |= (4+1)<<12;
}

inline void pinA11_Output_OD_50()
{
_GPIOA_(GPIOX_CRH) &= ~((8)<<12);
_GPIOA_(GPIOX_CRH) |= (4+2+1)<<12;
}

inline void pinA11_Output_AFPP_2()
{
_GPIOA_(GPIOX_CRH) &= ~((4+1)<<12);
_GPIOA_(GPIOX_CRH) |= (8+2)<<12;
}

inline void pinA11_Output_AFPP_10()
{
_GPIOA_(GPIOX_CRH) &= ~((4+2)<<12);
_GPIOA_(GPIOX_CRH) |= (8+1)<<12;
}

inline void pinA11_Output_AFPP_50()
{
_GPIOA_(GPIOX_CRH) &= ~((4)<<12);
_GPIOA_(GPIOX_CRH) |= (8+2+1)<<12;
}

inline void pinA11_Output_AFOD_2()
{
_GPIOA_(GPIOX_CRH) &= ~((1)<<12);
_GPIOA_(GPIOX_CRH) |= (8+2+4)<<12;
}

inline void pinA11_Output_AFOD_10()
{
_GPIOA_(GPIOX_CRH) &= ~((2)<<12);
_GPIOA_(GPIOX_CRH) |= (8+4+1)<<12;
}

inline void pinA11_Output_AFOD_50()
{
_GPIOA_(GPIOX_CRH) |= (8+4+2+1)<<12;
}

inline void pinA12_Input()
{
_GPIOA_(GPIOX_CRH) &= ~((8+2+1)<<16);
_GPIOA_(GPIOX_CRH) |= (4)<<16;
}

inline void pinA12_Input_PU()
{
_GPIOA_(GPIOX_CRH) &= ~((4+2+1)<<16);
_GPIOA_(GPIOX_CRH) |= (8)<<16;
_GPIOA_(GPIOX_ODR) |= (1)<<4;
}

inline void pinA12_Input_PD()
{
_GPIOA_(GPIOX_CRH) &= ~((4+2+1)<<16);
_GPIOA_(GPIOX_CRH) |= (8)<<16;
_GPIOA_(GPIOX_ODR) &= ~(1<<4);
}

inline void pinA12_Analog()
{
_GPIOA_(GPIOX_CRH) &= ~((8+4+2+1)<<16);
}

inline void pinA12_Output()
{
_GPIOA_(GPIOX_CRH) &= ~((8+4+1)<<16);
_GPIOA_(GPIOX_CRH) |= (2)<<16;
}

inline void pinA12_Output_OD()
{
_GPIOA_(GPIOX_CRH) &= ~((8+1)<<16);
_GPIOA_(GPIOX_CRH) |= (2+4)<<16;
}

inline void pinA12_Output_PP_2()
{
_GPIOA_(GPIOX_CRH) &= ~((8+4+1)<<16);
_GPIOA_(GPIOX_CRH) |= (2)<<16;
}

inline void pinA12_Output_PP_10()
{
_GPIOA_(GPIOX_CRH) &= ~((8+4+2)<<16);
_GPIOA_(GPIOX_CRH) |= (1)<<16;
}

inline void pinA12_Output_PP_50()
{
_GPIOA_(GPIOX_CRH) &= ~((8+4)<<16);
_GPIOA_(GPIOX_CRH) |= (2+1)<<16;
}

inline void pinA12_Output_OD_2()
{
_GPIOA_(GPIOX_CRH) &= ~((8+1)<<16);
_GPIOA_(GPIOX_CRH) |= (2+4)<<16;
}

inline void pinA12_Output_OD_10()
{
_GPIOA_(GPIOX_CRH) &= ~((8+2)<<16);
_GPIOA_(GPIOX_CRH) |= (4+1)<<16;
}

inline void pinA12_Output_OD_50()
{
_GPIOA_(GPIOX_CRH) &= ~((8)<<16);
_GPIOA_(GPIOX_CRH) |= (4+2+1)<<16;
}

inline void pinA12_Output_AFPP_2()
{
_GPIOA_(GPIOX_CRH) &= ~((4+1)<<16);
_GPIOA_(GPIOX_CRH) |= (8+2)<<16;
}

inline void pinA12_Output_AFPP_10()
{
_GPIOA_(GPIOX_CRH) &= ~((4+2)<<16);
_GPIOA_(GPIOX_CRH) |= (8+1)<<16;
}

inline void pinA12_Output_AFPP_50()
{
_GPIOA_(GPIOX_CRH) &= ~((4)<<16);
_GPIOA_(GPIOX_CRH) |= (8+2+1)<<16;
}

inline void pinA12_Output_AFOD_2()
{
_GPIOA_(GPIOX_CRH) &= ~((1)<<16);
_GPIOA_(GPIOX_CRH) |= (8+2+4)<<16;
}

inline void pinA12_Output_AFOD_10()
{
_GPIOA_(GPIOX_CRH) &= ~((2)<<16);
_GPIOA_(GPIOX_CRH) |= (8+4+1)<<16;
}

inline void pinA12_Output_AFOD_50()
{
_GPIOA_(GPIOX_CRH) |= (8+4+2+1)<<16;
}

inline void pinA13_Input()
{
_GPIOA_(GPIOX_CRH) &= ~((8+2+1)<<20);
_GPIOA_(GPIOX_CRH) |= (4)<<20;
}

