Ontaelio/STM32F103-Ublink-framework/stm32f103_gpio_func.h
inline void pinA13_Input_PU()
{
_GPIOA_(GPIOX_CRH) &= ~((4+2+1)<<20);
_GPIOA_(GPIOX_CRH) |= (8)<<20;
_GPIOA_(GPIOX_ODR) |= (1)<<5;
}

inline void pinA13_Input_PD()
{
_GPIOA_(GPIOX_CRH) &= ~((4+2+1)<<20);
_GPIOA_(GPIOX_CRH) |= (8)<<20;
_GPIOA_(GPIOX_ODR) &= ~(1<<5);
}

inline void pinA13_Analog()
{
_GPIOA_(GPIOX_CRH) &= ~((8+4+2+1)<<20);
}

inline void pinA13_Output()
{
_GPIOA_(GPIOX_CRH) &= ~((8+4+1)<<20);
_GPIOA_(GPIOX_CRH) |= (2)<<20;
}

inline void pinA13_Output_OD()
{
_GPIOA_(GPIOX_CRH) &= ~((8+1)<<20);
_GPIOA_(GPIOX_CRH) |= (2+4)<<20;
}

inline void pinA13_Output_PP_2()
{
_GPIOA_(GPIOX_CRH) &= ~((8+4+1)<<20);
_GPIOA_(GPIOX_CRH) |= (2)<<20;
}

inline void pinA13_Output_PP_10()
{
_GPIOA_(GPIOX_CRH) &= ~((8+4+2)<<20);
_GPIOA_(GPIOX_CRH) |= (1)<<20;
}

inline void pinA13_Output_PP_50()
{
_GPIOA_(GPIOX_CRH) &= ~((8+4)<<20);
_GPIOA_(GPIOX_CRH) |= (2+1)<<20;
}

inline void pinA13_Output_OD_2()
{
_GPIOA_(GPIOX_CRH) &= ~((8+1)<<20);
_GPIOA_(GPIOX_CRH) |= (2+4)<<20;
}

inline void pinA13_Output_OD_10()
{
_GPIOA_(GPIOX_CRH) &= ~((8+2)<<20);
_GPIOA_(GPIOX_CRH) |= (4+1)<<20;
}

inline void pinA13_Output_OD_50()
{
_GPIOA_(GPIOX_CRH) &= ~((8)<<20);
_GPIOA_(GPIOX_CRH) |= (4+2+1)<<20;
}

inline void pinA13_Output_AFPP_2()
{
_GPIOA_(GPIOX_CRH) &= ~((4+1)<<20);
_GPIOA_(GPIOX_CRH) |= (8+2)<<20;
}

inline void pinA13_Output_AFPP_10()
{
_GPIOA_(GPIOX_CRH) &= ~((4+2)<<20);
_GPIOA_(GPIOX_CRH) |= (8+1)<<20;
}

inline void pinA13_Output_AFPP_50()
{
_GPIOA_(GPIOX_CRH) &= ~((4)<<20);
_GPIOA_(GPIOX_CRH) |= (8+2+1)<<20;
}

inline void pinA13_Output_AFOD_2()
{
_GPIOA_(GPIOX_CRH) &= ~((1)<<20);
_GPIOA_(GPIOX_CRH) |= (8+2+4)<<20;
}

inline void pinA13_Output_AFOD_10()
{
_GPIOA_(GPIOX_CRH) &= ~((2)<<20);
_GPIOA_(GPIOX_CRH) |= (8+4+1)<<20;
}

inline void pinA13_Output_AFOD_50()
{
_GPIOA_(GPIOX_CRH) |= (8+4+2+1)<<20;
}

inline void pinA14_Input()
{
_GPIOA_(GPIOX_CRH) &= ~((8+2+1)<<24);
_GPIOA_(GPIOX_CRH) |= (4)<<24;
}

inline void pinA14_Input_PU()
{
_GPIOA_(GPIOX_CRH) &= ~((4+2+1)<<24);
_GPIOA_(GPIOX_CRH) |= (8)<<24;
_GPIOA_(GPIOX_ODR) |= (1)<<6;
}

inline void pinA14_Input_PD()
{
_GPIOA_(GPIOX_CRH) &= ~((4+2+1)<<24);
_GPIOA_(GPIOX_CRH) |= (8)<<24;
_GPIOA_(GPIOX_ODR) &= ~(1<<6);
}

inline void pinA14_Analog()
{
_GPIOA_(GPIOX_CRH) &= ~((8+4+2+1)<<24);
}

inline void pinA14_Output()
{
_GPIOA_(GPIOX_CRH) &= ~((8+4+1)<<24);
_GPIOA_(GPIOX_CRH) |= (2)<<24;
}

inline void pinA14_Output_OD()
{
_GPIOA_(GPIOX_CRH) &= ~((8+1)<<24);
_GPIOA_(GPIOX_CRH) |= (2+4)<<24;
}

inline void pinA14_Output_PP_2()
{
_GPIOA_(GPIOX_CRH) &= ~((8+4+1)<<24);
_GPIOA_(GPIOX_CRH) |= (2)<<24;
}

inline void pinA14_Output_PP_10()
{
_GPIOA_(GPIOX_CRH) &= ~((8+4+2)<<24);
_GPIOA_(GPIOX_CRH) |= (1)<<24;
}

inline void pinA14_Output_PP_50()
{
_GPIOA_(GPIOX_CRH) &= ~((8+4)<<24);
_GPIOA_(GPIOX_CRH) |= (2+1)<<24;
}

inline void pinA14_Output_OD_2()
{
_GPIOA_(GPIOX_CRH) &= ~((8+1)<<24);
_GPIOA_(GPIOX_CRH) |= (2+4)<<24;
}

inline void pinA14_Output_OD_10()
{
_GPIOA_(GPIOX_CRH) &= ~((8+2)<<24);
_GPIOA_(GPIOX_CRH) |= (4+1)<<24;
}

inline void pinA14_Output_OD_50()
{
_GPIOA_(GPIOX_CRH) &= ~((8)<<24);
_GPIOA_(GPIOX_CRH) |= (4+2+1)<<24;
}

inline void pinA14_Output_AFPP_2()
{
_GPIOA_(GPIOX_CRH) &= ~((4+1)<<24);
_GPIOA_(GPIOX_CRH) |= (8+2)<<24;
}

inline void pinA14_Output_AFPP_10()
{
_GPIOA_(GPIOX_CRH) &= ~((4+2)<<24);
_GPIOA_(GPIOX_CRH) |= (8+1)<<24;
}

inline void pinA14_Output_AFPP_50()
{
_GPIOA_(GPIOX_CRH) &= ~((4)<<24);
_GPIOA_(GPIOX_CRH) |= (8+2+1)<<24;
}

inline void pinA14_Output_AFOD_2()
{
_GPIOA_(GPIOX_CRH) &= ~((1)<<24);
_GPIOA_(GPIOX_CRH) |= (8+2+4)<<24;
}

inline void pinA14_Output_AFOD_10()
{
_GPIOA_(GPIOX_CRH) &= ~((2)<<24);
_GPIOA_(GPIOX_CRH) |= (8+4+1)<<24;
}

inline void pinA14_Output_AFOD_50()
{
_GPIOA_(GPIOX_CRH) |= (8+4+2+1)<<24;
}

inline void pinA15_Input()
{
_GPIOA_(GPIOX_CRH) &= ~((8+2+1)<<28);
_GPIOA_(GPIOX_CRH) |= (4)<<28;
}

inline void pinA15_Input_PU()
{
_GPIOA_(GPIOX_CRH) &= ~((4+2+1)<<28);
_GPIOA_(GPIOX_CRH) |= (8)<<28;
_GPIOA_(GPIOX_ODR) |= (1)<<7;
}

inline void pinA15_Input_PD()
{
_GPIOA_(GPIOX_CRH) &= ~((4+2+1)<<28);
_GPIOA_(GPIOX_CRH) |= (8)<<28;
_GPIOA_(GPIOX_ODR) &= ~(1<<7);
}

inline void pinA15_Analog()
{
_GPIOA_(GPIOX_CRH) &= ~((8+4+2+1)<<28);
}

inline void pinA15_Output()
{
_GPIOA_(GPIOX_CRH) &= ~((8+4+1)<<28);
_GPIOA_(GPIOX_CRH) |= (2)<<28;
}

inline void pinA15_Output_OD()
{
_GPIOA_(GPIOX_CRH) &= ~((8+1)<<28);
_GPIOA_(GPIOX_CRH) |= (2+4)<<28;
}

inline void pinA15_Output_PP_2()
{
_GPIOA_(GPIOX_CRH) &= ~((8+4+1)<<28);
_GPIOA_(GPIOX_CRH) |= (2)<<28;
}

inline void pinA15_Output_PP_10()
{
_GPIOA_(GPIOX_CRH) &= ~((8+4+2)<<28);
_GPIOA_(GPIOX_CRH) |= (1)<<28;
}

inline void pinA15_Output_PP_50()
{
_GPIOA_(GPIOX_CRH) &= ~((8+4)<<28);
_GPIOA_(GPIOX_CRH) |= (2+1)<<28;
}

inline void pinA15_Output_OD_2()
{
_GPIOA_(GPIOX_CRH) &= ~((8+1)<<28);
_GPIOA_(GPIOX_CRH) |= (2+4)<<28;
}

inline void pinA15_Output_OD_10()
{
_GPIOA_(GPIOX_CRH) &= ~((8+2)<<28);
_GPIOA_(GPIOX_CRH) |= (4+1)<<28;
}

inline void pinA15_Output_OD_50()
{
_GPIOA_(GPIOX_CRH) &= ~((8)<<28);
_GPIOA_(GPIOX_CRH) |= (4+2+1)<<28;
}

inline void pinA15_Output_AFPP_2()
{
_GPIOA_(GPIOX_CRH) &= ~((4+1)<<28);
_GPIOA_(GPIOX_CRH) |= (8+2)<<28;
}

inline void pinA15_Output_AFPP_10()
{
_GPIOA_(GPIOX_CRH) &= ~((4+2)<<28);
_GPIOA_(GPIOX_CRH) |= (8+1)<<28;
}

inline void pinA15_Output_AFPP_50()
{
_GPIOA_(GPIOX_CRH) &= ~((4)<<28);
_GPIOA_(GPIOX_CRH) |= (8+2+1)<<28;
}

inline void pinA15_Output_AFOD_2()
{
_GPIOA_(GPIOX_CRH) &= ~((1)<<28);
_GPIOA_(GPIOX_CRH) |= (8+2+4)<<28;
}

inline void pinA15_Output_AFOD_10()
{
_GPIOA_(GPIOX_CRH) &= ~((2)<<28);
_GPIOA_(GPIOX_CRH) |= (8+4+1)<<28;
}

inline void pinA15_Output_AFOD_50()
{
_GPIOA_(GPIOX_CRH) |= (8+4+2+1)<<28;
}

inline uint8_t readPinA0()
{
return ((_GPIOA_(GPIOX_IDR)>>0) & 1);
}

inline void setPinA0()
{
_GPIOA_(GPIOX_BSRR) = (1<<0);
}

inline void resetPinA0()
{
_GPIOA_(GPIOX_BRR) = (1<<0);
}

inline uint8_t readPinA1()
{
return ((_GPIOA_(GPIOX_IDR)>>1) & 1);
}

inline void setPinA1()
{
_GPIOA_(GPIOX_BSRR) = (1<<1);
}

inline void resetPinA1()
{
_GPIOA_(GPIOX_BRR) = (1<<1);
}

inline uint8_t readPinA2()
{
return ((_GPIOA_(GPIOX_IDR)>>2) & 1);
}

