Ontaelio/STM32F103-Ublink-framework/stm32f103_gpio_func.h
inline void setPinA2()
{
_GPIOA_(GPIOX_BSRR) = (1<<2);
}

inline void resetPinA2()
{
_GPIOA_(GPIOX_BRR) = (1<<2);
}

inline uint8_t readPinA3()
{
return ((_GPIOA_(GPIOX_IDR)>>3) & 1);
}

inline void setPinA3()
{
_GPIOA_(GPIOX_BSRR) = (1<<3);
}

inline void resetPinA3()
{
_GPIOA_(GPIOX_BRR) = (1<<3);
}

inline uint8_t readPinA4()
{
return ((_GPIOA_(GPIOX_IDR)>>4) & 1);
}

inline void setPinA4()
{
_GPIOA_(GPIOX_BSRR) = (1<<4);
}

inline void resetPinA4()
{
_GPIOA_(GPIOX_BRR) = (1<<4);
}

inline uint8_t readPinA5()
{
return ((_GPIOA_(GPIOX_IDR)>>5) & 1);
}

inline void setPinA5()
{
_GPIOA_(GPIOX_BSRR) = (1<<5);
}

inline void resetPinA5()
{
_GPIOA_(GPIOX_BRR) = (1<<5);
}

inline uint8_t readPinA6()
{
return ((_GPIOA_(GPIOX_IDR)>>6) & 1);
}

inline void setPinA6()
{
_GPIOA_(GPIOX_BSRR) = (1<<6);
}

inline void resetPinA6()
{
_GPIOA_(GPIOX_BRR) = (1<<6);
}

inline uint8_t readPinA7()
{
return ((_GPIOA_(GPIOX_IDR)>>7) & 1);
}

inline void setPinA7()
{
_GPIOA_(GPIOX_BSRR) = (1<<7);
}

inline void resetPinA7()
{
_GPIOA_(GPIOX_BRR) = (1<<7);
}

inline uint8_t readPinA8()
{
return ((_GPIOA_(GPIOX_IDR)>>8) & 1);
}

inline void setPinA8()
{
_GPIOA_(GPIOX_BSRR) = (1<<8);
}

inline void resetPinA8()
{
_GPIOA_(GPIOX_BRR) = (1<<8);
}

inline uint8_t readPinA9()
{
return ((_GPIOA_(GPIOX_IDR)>>9) & 1);
}

inline void setPinA9()
{
_GPIOA_(GPIOX_BSRR) = (1<<9);
}

inline void resetPinA9()
{
_GPIOA_(GPIOX_BRR) = (1<<9);
}

inline uint8_t readPinA10()
{
return ((_GPIOA_(GPIOX_IDR)>>10) & 1);
}

inline void setPinA10()
{
_GPIOA_(GPIOX_BSRR) = (1<<10);
}

inline void resetPinA10()
{
_GPIOA_(GPIOX_BRR) = (1<<10);
}

inline uint8_t readPinA11()
{
return ((_GPIOA_(GPIOX_IDR)>>11) & 1);
}

inline void setPinA11()
{
_GPIOA_(GPIOX_BSRR) = (1<<11);
}

inline void resetPinA11()
{
_GPIOA_(GPIOX_BRR) = (1<<11);
}

inline uint8_t readPinA12()
{
return ((_GPIOA_(GPIOX_IDR)>>12) & 1);
}

inline void setPinA12()
{
_GPIOA_(GPIOX_BSRR) = (1<<12);
}

inline void resetPinA12()
{
_GPIOA_(GPIOX_BRR) = (1<<12);
}

inline uint8_t readPinA13()
{
return ((_GPIOA_(GPIOX_IDR)>>13) & 1);
}

inline void setPinA13()
{
_GPIOA_(GPIOX_BSRR) = (1<<13);
}

inline void resetPinA13()
{
_GPIOA_(GPIOX_BRR) = (1<<13);
}

inline uint8_t readPinA14()
{
return ((_GPIOA_(GPIOX_IDR)>>14) & 1);
}

inline void setPinA14()
{
_GPIOA_(GPIOX_BSRR) = (1<<14);
}

inline void resetPinA14()
{
_GPIOA_(GPIOX_BRR) = (1<<14);
}

inline uint8_t readPinA15()
{
return ((_GPIOA_(GPIOX_IDR)>>15) & 1);
}

inline void setPinA15()
{
_GPIOA_(GPIOX_BSRR) = (1<<15);
}

inline void resetPinA15()
{
_GPIOA_(GPIOX_BRR) = (1<<15);
}

inline void pinC0_Input()
{
_GPIOC_(GPIOX_CRL) &= ~((8+2+1)<<0);
_GPIOC_(GPIOX_CRL) |= (4)<<0;
}

inline void pinC0_Input_PU()
{
_GPIOC_(GPIOX_CRL) &= ~((4+2+1)<<0);
_GPIOC_(GPIOX_CRL) |= (8)<<0;
_GPIOC_(GPIOX_ODR) |= (1)<<0;
}

inline void pinC0_Input_PD()
{
_GPIOC_(GPIOX_CRL) &= ~((4+2+1)<<0);
_GPIOC_(GPIOX_CRL) |= (8)<<0;
_GPIOC_(GPIOX_ODR) &= ~(1<<0);
}

inline void pinC0_Analog()
{
_GPIOC_(GPIOX_CRL) &= ~((8+4+2+1)<<0);
}

inline void pinC0_Output()
{
_GPIOC_(GPIOX_CRL) &= ~((8+4+1)<<0);
_GPIOC_(GPIOX_CRL) |= (2)<<0;
}

inline void pinC0_Output_OD()
{
_GPIOC_(GPIOX_CRL) &= ~((8+1)<<0);
_GPIOC_(GPIOX_CRL) |= (2+4)<<0;
}

inline void pinC0_Output_PP_2()
{
_GPIOC_(GPIOX_CRL) &= ~((8+4+1)<<0);
_GPIOC_(GPIOX_CRL) |= (2)<<0;
}

inline void pinC0_Output_PP_10()
{
_GPIOC_(GPIOX_CRL) &= ~((8+4+2)<<0);
_GPIOC_(GPIOX_CRL) |= (1)<<0;
}

inline void pinC0_Output_PP_50()
{
_GPIOC_(GPIOX_CRL) &= ~((8+4)<<0);
_GPIOC_(GPIOX_CRL) |= (2+1)<<0;
}

inline void pinC0_Output_OD_2()
{
_GPIOC_(GPIOX_CRL) &= ~((8+1)<<0);
_GPIOC_(GPIOX_CRL) |= (2+4)<<0;
}

inline void pinC0_Output_OD_10()
{
_GPIOC_(GPIOX_CRL) &= ~((8+2)<<0);
_GPIOC_(GPIOX_CRL) |= (4+1)<<0;
}

inline void pinC0_Output_OD_50()
{
_GPIOC_(GPIOX_CRL) &= ~((8)<<0);
_GPIOC_(GPIOX_CRL) |= (4+2+1)<<0;
}

inline void pinC0_Output_AFPP_2()
{
_GPIOC_(GPIOX_CRL) &= ~((4+1)<<0);
_GPIOC_(GPIOX_CRL) |= (8+2)<<0;
}

inline void pinC0_Output_AFPP_10()
{
_GPIOC_(GPIOX_CRL) &= ~((4+2)<<0);
_GPIOC_(GPIOX_CRL) |= (8+1)<<0;
}

inline void pinC0_Output_AFPP_50()
{
_GPIOC_(GPIOX_CRL) &= ~((4)<<0);
_GPIOC_(GPIOX_CRL) |= (8+2+1)<<0;
}

inline void pinC0_Output_AFOD_2()
{
_GPIOC_(GPIOX_CRL) &= ~((1)<<0);
_GPIOC_(GPIOX_CRL) |= (8+2+4)<<0;
}

inline void pinC0_Output_AFOD_10()
{
_GPIOC_(GPIOX_CRL) &= ~((2)<<0);
_GPIOC_(GPIOX_CRL) |= (8+4+1)<<0;
}

inline void pinC0_Output_AFOD_50()
{
_GPIOC_(GPIOX_CRL) |= (8+4+2+1)<<0;
}

inline void pinC1_Input()
{
_GPIOC_(GPIOX_CRL) &= ~((8+2+1)<<4);
_GPIOC_(GPIOX_CRL) |= (4)<<4;
}

inline void pinC1_Input_PU()
{
_GPIOC_(GPIOX_CRL) &= ~((4+2+1)<<4);
_GPIOC_(GPIOX_CRL) |= (8)<<4;
_GPIOC_(GPIOX_ODR) |= (1)<<1;
}

inline void pinC1_Input_PD()
{
_GPIOC_(GPIOX_CRL) &= ~((4+2+1)<<4);
_GPIOC_(GPIOX_CRL) |= (8)<<4;
_GPIOC_(GPIOX_ODR) &= ~(1<<1);
}

inline void pinC1_Analog()
{
_GPIOC_(GPIOX_CRL) &= ~((8+4+2+1)<<4);
}

inline void pinC1_Output()
{
_GPIOC_(GPIOX_CRL) &= ~((8+4+1)<<4);
_GPIOC_(GPIOX_CRL) |= (2)<<4;
}

inline void pinC1_Output_OD()
{
_GPIOC_(GPIOX_CRL) &= ~((8+1)<<4);
_GPIOC_(GPIOX_CRL) |= (2+4)<<4;
}

inline void pinC1_Output_PP_2()
{
_GPIOC_(GPIOX_CRL) &= ~((8+4+1)<<4);
_GPIOC_(GPIOX_CRL) |= (2)<<4;
}

inline void pinC1_Output_PP_10()
{
_GPIOC_(GPIOX_CRL) &= ~((8+4+2)<<4);
_GPIOC_(GPIOX_CRL) |= (1)<<4;
}

inline void pinC1_Output_PP_50()
{
_GPIOC_(GPIOX_CRL) &= ~((8+4)<<4);
_GPIOC_(GPIOX_CRL) |= (2+1)<<4;
}

inline void pinC1_Output_OD_2()
{
_GPIOC_(GPIOX_CRL) &= ~((8+1)<<4);
_GPIOC_(GPIOX_CRL) |= (2+4)<<4;
}

inline void pinC1_Output_OD_10()
{
_GPIOC_(GPIOX_CRL) &= ~((8+2)<<4);
_GPIOC_(GPIOX_CRL) |= (4+1)<<4;
}

inline void pinC1_Output_OD_50()
{
_GPIOC_(GPIOX_CRL) &= ~((8)<<4);
_GPIOC_(GPIOX_CRL) |= (4+2+1)<<4;
}

inline void pinC1_Output_AFPP_2()
{
_GPIOC_(GPIOX_CRL) &= ~((4+1)<<4);
_GPIOC_(GPIOX_CRL) |= (8+2)<<4;
}

inline void pinC1_Output_AFPP_10()
{
_GPIOC_(GPIOX_CRL) &= ~((4+2)<<4);
_GPIOC_(GPIOX_CRL) |= (8+1)<<4;
}

inline void pinC1_Output_AFPP_50()
{
_GPIOC_(GPIOX_CRL) &= ~((4)<<4);
_GPIOC_(GPIOX_CRL) |= (8+2+1)<<4;
}

inline void pinC1_Output_AFOD_2()
{
_GPIOC_(GPIOX_CRL) &= ~((1)<<4);
_GPIOC_(GPIOX_CRL) |= (8+2+4)<<4;
}

inline void pinC1_Output_AFOD_10()
{
_GPIOC_(GPIOX_CRL) &= ~((2)<<4);
_GPIOC_(GPIOX_CRL) |= (8+4+1)<<4;
}

inline void pinC1_Output_AFOD_50()
{
_GPIOC_(GPIOX_CRL) |= (8+4+2+1)<<4;
}

inline void pinC2_Input()
{
_GPIOC_(GPIOX_CRL) &= ~((8+2+1)<<8);
_GPIOC_(GPIOX_CRL) |= (4)<<8;
}

inline void pinC2_Input_PU()
{
_GPIOC_(GPIOX_CRL) &= ~((4+2+1)<<8);
_GPIOC_(GPIOX_CRL) |= (8)<<8;
_GPIOC_(GPIOX_ODR) |= (1)<<2;
}

