Ontaelio/STM32F103-Ublink-framework/stm32f103_gpio_func.h
inline void pinC2_Input_PD()
{
_GPIOC_(GPIOX_CRL) &= ~((4+2+1)<<8);
_GPIOC_(GPIOX_CRL) |= (8)<<8;
_GPIOC_(GPIOX_ODR) &= ~(1<<2);
}

inline void pinC2_Analog()
{
_GPIOC_(GPIOX_CRL) &= ~((8+4+2+1)<<8);
}

inline void pinC2_Output()
{
_GPIOC_(GPIOX_CRL) &= ~((8+4+1)<<8);
_GPIOC_(GPIOX_CRL) |= (2)<<8;
}

inline void pinC2_Output_OD()
{
_GPIOC_(GPIOX_CRL) &= ~((8+1)<<8);
_GPIOC_(GPIOX_CRL) |= (2+4)<<8;
}

inline void pinC2_Output_PP_2()
{
_GPIOC_(GPIOX_CRL) &= ~((8+4+1)<<8);
_GPIOC_(GPIOX_CRL) |= (2)<<8;
}

inline void pinC2_Output_PP_10()
{
_GPIOC_(GPIOX_CRL) &= ~((8+4+2)<<8);
_GPIOC_(GPIOX_CRL) |= (1)<<8;
}

inline void pinC2_Output_PP_50()
{
_GPIOC_(GPIOX_CRL) &= ~((8+4)<<8);
_GPIOC_(GPIOX_CRL) |= (2+1)<<8;
}

inline void pinC2_Output_OD_2()
{
_GPIOC_(GPIOX_CRL) &= ~((8+1)<<8);
_GPIOC_(GPIOX_CRL) |= (2+4)<<8;
}

inline void pinC2_Output_OD_10()
{
_GPIOC_(GPIOX_CRL) &= ~((8+2)<<8);
_GPIOC_(GPIOX_CRL) |= (4+1)<<8;
}

inline void pinC2_Output_OD_50()
{
_GPIOC_(GPIOX_CRL) &= ~((8)<<8);
_GPIOC_(GPIOX_CRL) |= (4+2+1)<<8;
}

inline void pinC2_Output_AFPP_2()
{
_GPIOC_(GPIOX_CRL) &= ~((4+1)<<8);
_GPIOC_(GPIOX_CRL) |= (8+2)<<8;
}

inline void pinC2_Output_AFPP_10()
{
_GPIOC_(GPIOX_CRL) &= ~((4+2)<<8);
_GPIOC_(GPIOX_CRL) |= (8+1)<<8;
}

inline void pinC2_Output_AFPP_50()
{
_GPIOC_(GPIOX_CRL) &= ~((4)<<8);
_GPIOC_(GPIOX_CRL) |= (8+2+1)<<8;
}

inline void pinC2_Output_AFOD_2()
{
_GPIOC_(GPIOX_CRL) &= ~((1)<<8);
_GPIOC_(GPIOX_CRL) |= (8+2+4)<<8;
}

inline void pinC2_Output_AFOD_10()
{
_GPIOC_(GPIOX_CRL) &= ~((2)<<8);
_GPIOC_(GPIOX_CRL) |= (8+4+1)<<8;
}

inline void pinC2_Output_AFOD_50()
{
_GPIOC_(GPIOX_CRL) |= (8+4+2+1)<<8;
}

inline void pinC3_Input()
{
_GPIOC_(GPIOX_CRL) &= ~((8+2+1)<<12);
_GPIOC_(GPIOX_CRL) |= (4)<<12;
}

inline void pinC3_Input_PU()
{
_GPIOC_(GPIOX_CRL) &= ~((4+2+1)<<12);
_GPIOC_(GPIOX_CRL) |= (8)<<12;
_GPIOC_(GPIOX_ODR) |= (1)<<3;
}

inline void pinC3_Input_PD()
{
_GPIOC_(GPIOX_CRL) &= ~((4+2+1)<<12);
_GPIOC_(GPIOX_CRL) |= (8)<<12;
_GPIOC_(GPIOX_ODR) &= ~(1<<3);
}

inline void pinC3_Analog()
{
_GPIOC_(GPIOX_CRL) &= ~((8+4+2+1)<<12);
}

inline void pinC3_Output()
{
_GPIOC_(GPIOX_CRL) &= ~((8+4+1)<<12);
_GPIOC_(GPIOX_CRL) |= (2)<<12;
}

inline void pinC3_Output_OD()
{
_GPIOC_(GPIOX_CRL) &= ~((8+1)<<12);
_GPIOC_(GPIOX_CRL) |= (2+4)<<12;
}

inline void pinC3_Output_PP_2()
{
_GPIOC_(GPIOX_CRL) &= ~((8+4+1)<<12);
_GPIOC_(GPIOX_CRL) |= (2)<<12;
}

inline void pinC3_Output_PP_10()
{
_GPIOC_(GPIOX_CRL) &= ~((8+4+2)<<12);
_GPIOC_(GPIOX_CRL) |= (1)<<12;
}

inline void pinC3_Output_PP_50()
{
_GPIOC_(GPIOX_CRL) &= ~((8+4)<<12);
_GPIOC_(GPIOX_CRL) |= (2+1)<<12;
}

inline void pinC3_Output_OD_2()
{
_GPIOC_(GPIOX_CRL) &= ~((8+1)<<12);
_GPIOC_(GPIOX_CRL) |= (2+4)<<12;
}

inline void pinC3_Output_OD_10()
{
_GPIOC_(GPIOX_CRL) &= ~((8+2)<<12);
_GPIOC_(GPIOX_CRL) |= (4+1)<<12;
}

inline void pinC3_Output_OD_50()
{
_GPIOC_(GPIOX_CRL) &= ~((8)<<12);
_GPIOC_(GPIOX_CRL) |= (4+2+1)<<12;
}

inline void pinC3_Output_AFPP_2()
{
_GPIOC_(GPIOX_CRL) &= ~((4+1)<<12);
_GPIOC_(GPIOX_CRL) |= (8+2)<<12;
}

inline void pinC3_Output_AFPP_10()
{
_GPIOC_(GPIOX_CRL) &= ~((4+2)<<12);
_GPIOC_(GPIOX_CRL) |= (8+1)<<12;
}

inline void pinC3_Output_AFPP_50()
{
_GPIOC_(GPIOX_CRL) &= ~((4)<<12);
_GPIOC_(GPIOX_CRL) |= (8+2+1)<<12;
}

inline void pinC3_Output_AFOD_2()
{
_GPIOC_(GPIOX_CRL) &= ~((1)<<12);
_GPIOC_(GPIOX_CRL) |= (8+2+4)<<12;
}

inline void pinC3_Output_AFOD_10()
{
_GPIOC_(GPIOX_CRL) &= ~((2)<<12);
_GPIOC_(GPIOX_CRL) |= (8+4+1)<<12;
}

inline void pinC3_Output_AFOD_50()
{
_GPIOC_(GPIOX_CRL) |= (8+4+2+1)<<12;
}

inline void pinC4_Input()
{
_GPIOC_(GPIOX_CRL) &= ~((8+2+1)<<16);
_GPIOC_(GPIOX_CRL) |= (4)<<16;
}

inline void pinC4_Input_PU()
{
_GPIOC_(GPIOX_CRL) &= ~((4+2+1)<<16);
_GPIOC_(GPIOX_CRL) |= (8)<<16;
_GPIOC_(GPIOX_ODR) |= (1)<<4;
}

inline void pinC4_Input_PD()
{
_GPIOC_(GPIOX_CRL) &= ~((4+2+1)<<16);
_GPIOC_(GPIOX_CRL) |= (8)<<16;
_GPIOC_(GPIOX_ODR) &= ~(1<<4);
}

inline void pinC4_Analog()
{
_GPIOC_(GPIOX_CRL) &= ~((8+4+2+1)<<16);
}

inline void pinC4_Output()
{
_GPIOC_(GPIOX_CRL) &= ~((8+4+1)<<16);
_GPIOC_(GPIOX_CRL) |= (2)<<16;
}

inline void pinC4_Output_OD()
{
_GPIOC_(GPIOX_CRL) &= ~((8+1)<<16);
_GPIOC_(GPIOX_CRL) |= (2+4)<<16;
}

inline void pinC4_Output_PP_2()
{
_GPIOC_(GPIOX_CRL) &= ~((8+4+1)<<16);
_GPIOC_(GPIOX_CRL) |= (2)<<16;
}

inline void pinC4_Output_PP_10()
{
_GPIOC_(GPIOX_CRL) &= ~((8+4+2)<<16);
_GPIOC_(GPIOX_CRL) |= (1)<<16;
}

inline void pinC4_Output_PP_50()
{
_GPIOC_(GPIOX_CRL) &= ~((8+4)<<16);
_GPIOC_(GPIOX_CRL) |= (2+1)<<16;
}

inline void pinC4_Output_OD_2()
{
_GPIOC_(GPIOX_CRL) &= ~((8+1)<<16);
_GPIOC_(GPIOX_CRL) |= (2+4)<<16;
}

inline void pinC4_Output_OD_10()
{
_GPIOC_(GPIOX_CRL) &= ~((8+2)<<16);
_GPIOC_(GPIOX_CRL) |= (4+1)<<16;
}

inline void pinC4_Output_OD_50()
{
_GPIOC_(GPIOX_CRL) &= ~((8)<<16);
_GPIOC_(GPIOX_CRL) |= (4+2+1)<<16;
}

inline void pinC4_Output_AFPP_2()
{
_GPIOC_(GPIOX_CRL) &= ~((4+1)<<16);
_GPIOC_(GPIOX_CRL) |= (8+2)<<16;
}

inline void pinC4_Output_AFPP_10()
{
_GPIOC_(GPIOX_CRL) &= ~((4+2)<<16);
_GPIOC_(GPIOX_CRL) |= (8+1)<<16;
}

inline void pinC4_Output_AFPP_50()
{
_GPIOC_(GPIOX_CRL) &= ~((4)<<16);
_GPIOC_(GPIOX_CRL) |= (8+2+1)<<16;
}

inline void pinC4_Output_AFOD_2()
{
_GPIOC_(GPIOX_CRL) &= ~((1)<<16);
_GPIOC_(GPIOX_CRL) |= (8+2+4)<<16;
}

inline void pinC4_Output_AFOD_10()
{
_GPIOC_(GPIOX_CRL) &= ~((2)<<16);
_GPIOC_(GPIOX_CRL) |= (8+4+1)<<16;
}

inline void pinC4_Output_AFOD_50()
{
_GPIOC_(GPIOX_CRL) |= (8+4+2+1)<<16;
}

inline void pinC5_Input()
{
_GPIOC_(GPIOX_CRL) &= ~((8+2+1)<<20);
_GPIOC_(GPIOX_CRL) |= (4)<<20;
}

inline void pinC5_Input_PU()
{
_GPIOC_(GPIOX_CRL) &= ~((4+2+1)<<20);
_GPIOC_(GPIOX_CRL) |= (8)<<20;
_GPIOC_(GPIOX_ODR) |= (1)<<5;
}

inline void pinC5_Input_PD()
{
_GPIOC_(GPIOX_CRL) &= ~((4+2+1)<<20);
_GPIOC_(GPIOX_CRL) |= (8)<<20;
_GPIOC_(GPIOX_ODR) &= ~(1<<5);
}

inline void pinC5_Analog()
{
_GPIOC_(GPIOX_CRL) &= ~((8+4+2+1)<<20);
}

inline void pinC5_Output()
{
_GPIOC_(GPIOX_CRL) &= ~((8+4+1)<<20);
_GPIOC_(GPIOX_CRL) |= (2)<<20;
}

inline void pinC5_Output_OD()
{
_GPIOC_(GPIOX_CRL) &= ~((8+1)<<20);
_GPIOC_(GPIOX_CRL) |= (2+4)<<20;
}

inline void pinC5_Output_PP_2()
{
_GPIOC_(GPIOX_CRL) &= ~((8+4+1)<<20);
_GPIOC_(GPIOX_CRL) |= (2)<<20;
}

inline void pinC5_Output_PP_10()
{
_GPIOC_(GPIOX_CRL) &= ~((8+4+2)<<20);
_GPIOC_(GPIOX_CRL) |= (1)<<20;
}

inline void pinC5_Output_PP_50()
{
_GPIOC_(GPIOX_CRL) &= ~((8+4)<<20);
_GPIOC_(GPIOX_CRL) |= (2+1)<<20;
}

inline void pinC5_Output_OD_2()
{
_GPIOC_(GPIOX_CRL) &= ~((8+1)<<20);
_GPIOC_(GPIOX_CRL) |= (2+4)<<20;
}

