Ontaelio/STM32F103-Ublink-framework/stm32f103_gpio_func.h
inline void pinC5_Output_OD_10()
{
_GPIOC_(GPIOX_CRL) &= ~((8+2)<<20);
_GPIOC_(GPIOX_CRL) |= (4+1)<<20;
}

inline void pinC5_Output_OD_50()
{
_GPIOC_(GPIOX_CRL) &= ~((8)<<20);
_GPIOC_(GPIOX_CRL) |= (4+2+1)<<20;
}

inline void pinC5_Output_AFPP_2()
{
_GPIOC_(GPIOX_CRL) &= ~((4+1)<<20);
_GPIOC_(GPIOX_CRL) |= (8+2)<<20;
}

inline void pinC5_Output_AFPP_10()
{
_GPIOC_(GPIOX_CRL) &= ~((4+2)<<20);
_GPIOC_(GPIOX_CRL) |= (8+1)<<20;
}

inline void pinC5_Output_AFPP_50()
{
_GPIOC_(GPIOX_CRL) &= ~((4)<<20);
_GPIOC_(GPIOX_CRL) |= (8+2+1)<<20;
}

inline void pinC5_Output_AFOD_2()
{
_GPIOC_(GPIOX_CRL) &= ~((1)<<20);
_GPIOC_(GPIOX_CRL) |= (8+2+4)<<20;
}

inline void pinC5_Output_AFOD_10()
{
_GPIOC_(GPIOX_CRL) &= ~((2)<<20);
_GPIOC_(GPIOX_CRL) |= (8+4+1)<<20;
}

inline void pinC5_Output_AFOD_50()
{
_GPIOC_(GPIOX_CRL) |= (8+4+2+1)<<20;
}

inline void pinC6_Input()
{
_GPIOC_(GPIOX_CRL) &= ~((8+2+1)<<24);
_GPIOC_(GPIOX_CRL) |= (4)<<24;
}

inline void pinC6_Input_PU()
{
_GPIOC_(GPIOX_CRL) &= ~((4+2+1)<<24);
_GPIOC_(GPIOX_CRL) |= (8)<<24;
_GPIOC_(GPIOX_ODR) |= (1)<<6;
}

inline void pinC6_Input_PD()
{
_GPIOC_(GPIOX_CRL) &= ~((4+2+1)<<24);
_GPIOC_(GPIOX_CRL) |= (8)<<24;
_GPIOC_(GPIOX_ODR) &= ~(1<<6);
}

inline void pinC6_Analog()
{
_GPIOC_(GPIOX_CRL) &= ~((8+4+2+1)<<24);
}

inline void pinC6_Output()
{
_GPIOC_(GPIOX_CRL) &= ~((8+4+1)<<24);
_GPIOC_(GPIOX_CRL) |= (2)<<24;
}

inline void pinC6_Output_OD()
{
_GPIOC_(GPIOX_CRL) &= ~((8+1)<<24);
_GPIOC_(GPIOX_CRL) |= (2+4)<<24;
}

inline void pinC6_Output_PP_2()
{
_GPIOC_(GPIOX_CRL) &= ~((8+4+1)<<24);
_GPIOC_(GPIOX_CRL) |= (2)<<24;
}

inline void pinC6_Output_PP_10()
{
_GPIOC_(GPIOX_CRL) &= ~((8+4+2)<<24);
_GPIOC_(GPIOX_CRL) |= (1)<<24;
}

inline void pinC6_Output_PP_50()
{
_GPIOC_(GPIOX_CRL) &= ~((8+4)<<24);
_GPIOC_(GPIOX_CRL) |= (2+1)<<24;
}

inline void pinC6_Output_OD_2()
{
_GPIOC_(GPIOX_CRL) &= ~((8+1)<<24);
_GPIOC_(GPIOX_CRL) |= (2+4)<<24;
}

inline void pinC6_Output_OD_10()
{
_GPIOC_(GPIOX_CRL) &= ~((8+2)<<24);
_GPIOC_(GPIOX_CRL) |= (4+1)<<24;
}

inline void pinC6_Output_OD_50()
{
_GPIOC_(GPIOX_CRL) &= ~((8)<<24);
_GPIOC_(GPIOX_CRL) |= (4+2+1)<<24;
}

inline void pinC6_Output_AFPP_2()
{
_GPIOC_(GPIOX_CRL) &= ~((4+1)<<24);
_GPIOC_(GPIOX_CRL) |= (8+2)<<24;
}

inline void pinC6_Output_AFPP_10()
{
_GPIOC_(GPIOX_CRL) &= ~((4+2)<<24);
_GPIOC_(GPIOX_CRL) |= (8+1)<<24;
}

inline void pinC6_Output_AFPP_50()
{
_GPIOC_(GPIOX_CRL) &= ~((4)<<24);
_GPIOC_(GPIOX_CRL) |= (8+2+1)<<24;
}

inline void pinC6_Output_AFOD_2()
{
_GPIOC_(GPIOX_CRL) &= ~((1)<<24);
_GPIOC_(GPIOX_CRL) |= (8+2+4)<<24;
}

inline void pinC6_Output_AFOD_10()
{
_GPIOC_(GPIOX_CRL) &= ~((2)<<24);
_GPIOC_(GPIOX_CRL) |= (8+4+1)<<24;
}

inline void pinC6_Output_AFOD_50()
{
_GPIOC_(GPIOX_CRL) |= (8+4+2+1)<<24;
}

inline void pinC7_Input()
{
_GPIOC_(GPIOX_CRL) &= ~((8+2+1)<<28);
_GPIOC_(GPIOX_CRL) |= (4)<<28;
}

inline void pinC7_Input_PU()
{
_GPIOC_(GPIOX_CRL) &= ~((4+2+1)<<28);
_GPIOC_(GPIOX_CRL) |= (8)<<28;
_GPIOC_(GPIOX_ODR) |= (1)<<7;
}

inline void pinC7_Input_PD()
{
_GPIOC_(GPIOX_CRL) &= ~((4+2+1)<<28);
_GPIOC_(GPIOX_CRL) |= (8)<<28;
_GPIOC_(GPIOX_ODR) &= ~(1<<7);
}

inline void pinC7_Analog()
{
_GPIOC_(GPIOX_CRL) &= ~((8+4+2+1)<<28);
}

inline void pinC7_Output()
{
_GPIOC_(GPIOX_CRL) &= ~((8+4+1)<<28);
_GPIOC_(GPIOX_CRL) |= (2)<<28;
}

inline void pinC7_Output_OD()
{
_GPIOC_(GPIOX_CRL) &= ~((8+1)<<28);
_GPIOC_(GPIOX_CRL) |= (2+4)<<28;
}

inline void pinC7_Output_PP_2()
{
_GPIOC_(GPIOX_CRL) &= ~((8+4+1)<<28);
_GPIOC_(GPIOX_CRL) |= (2)<<28;
}

inline void pinC7_Output_PP_10()
{
_GPIOC_(GPIOX_CRL) &= ~((8+4+2)<<28);
_GPIOC_(GPIOX_CRL) |= (1)<<28;
}

inline void pinC7_Output_PP_50()
{
_GPIOC_(GPIOX_CRL) &= ~((8+4)<<28);
_GPIOC_(GPIOX_CRL) |= (2+1)<<28;
}

inline void pinC7_Output_OD_2()
{
_GPIOC_(GPIOX_CRL) &= ~((8+1)<<28);
_GPIOC_(GPIOX_CRL) |= (2+4)<<28;
}

inline void pinC7_Output_OD_10()
{
_GPIOC_(GPIOX_CRL) &= ~((8+2)<<28);
_GPIOC_(GPIOX_CRL) |= (4+1)<<28;
}

inline void pinC7_Output_OD_50()
{
_GPIOC_(GPIOX_CRL) &= ~((8)<<28);
_GPIOC_(GPIOX_CRL) |= (4+2+1)<<28;
}

inline void pinC7_Output_AFPP_2()
{
_GPIOC_(GPIOX_CRL) &= ~((4+1)<<28);
_GPIOC_(GPIOX_CRL) |= (8+2)<<28;
}

inline void pinC7_Output_AFPP_10()
{
_GPIOC_(GPIOX_CRL) &= ~((4+2)<<28);
_GPIOC_(GPIOX_CRL) |= (8+1)<<28;
}

inline void pinC7_Output_AFPP_50()
{
_GPIOC_(GPIOX_CRL) &= ~((4)<<28);
_GPIOC_(GPIOX_CRL) |= (8+2+1)<<28;
}

inline void pinC7_Output_AFOD_2()
{
_GPIOC_(GPIOX_CRL) &= ~((1)<<28);
_GPIOC_(GPIOX_CRL) |= (8+2+4)<<28;
}

inline void pinC7_Output_AFOD_10()
{
_GPIOC_(GPIOX_CRL) &= ~((2)<<28);
_GPIOC_(GPIOX_CRL) |= (8+4+1)<<28;
}

inline void pinC7_Output_AFOD_50()
{
_GPIOC_(GPIOX_CRL) |= (8+4+2+1)<<28;
}

inline void pinC8_Input()
{
_GPIOC_(GPIOX_CRH) &= ~((8+2+1)<<0);
_GPIOC_(GPIOX_CRH) |= (4)<<0;
}

inline void pinC8_Input_PU()
{
_GPIOC_(GPIOX_CRH) &= ~((4+2+1)<<0);
_GPIOC_(GPIOX_CRH) |= (8)<<0;
_GPIOC_(GPIOX_ODR) |= (1)<<0;
}

inline void pinC8_Input_PD()
{
_GPIOC_(GPIOX_CRH) &= ~((4+2+1)<<0);
_GPIOC_(GPIOX_CRH) |= (8)<<0;
_GPIOC_(GPIOX_ODR) &= ~(1<<0);
}

inline void pinC8_Analog()
{
_GPIOC_(GPIOX_CRH) &= ~((8+4+2+1)<<0);
}

inline void pinC8_Output()
{
_GPIOC_(GPIOX_CRH) &= ~((8+4+1)<<0);
_GPIOC_(GPIOX_CRH) |= (2)<<0;
}

inline void pinC8_Output_OD()
{
_GPIOC_(GPIOX_CRH) &= ~((8+1)<<0);
_GPIOC_(GPIOX_CRH) |= (2+4)<<0;
}

inline void pinC8_Output_PP_2()
{
_GPIOC_(GPIOX_CRH) &= ~((8+4+1)<<0);
_GPIOC_(GPIOX_CRH) |= (2)<<0;
}

inline void pinC8_Output_PP_10()
{
_GPIOC_(GPIOX_CRH) &= ~((8+4+2)<<0);
_GPIOC_(GPIOX_CRH) |= (1)<<0;
}

inline void pinC8_Output_PP_50()
{
_GPIOC_(GPIOX_CRH) &= ~((8+4)<<0);
_GPIOC_(GPIOX_CRH) |= (2+1)<<0;
}

inline void pinC8_Output_OD_2()
{
_GPIOC_(GPIOX_CRH) &= ~((8+1)<<0);
_GPIOC_(GPIOX_CRH) |= (2+4)<<0;
}

inline void pinC8_Output_OD_10()
{
_GPIOC_(GPIOX_CRH) &= ~((8+2)<<0);
_GPIOC_(GPIOX_CRH) |= (4+1)<<0;
}

inline void pinC8_Output_OD_50()
{
_GPIOC_(GPIOX_CRH) &= ~((8)<<0);
_GPIOC_(GPIOX_CRH) |= (4+2+1)<<0;
}

inline void pinC8_Output_AFPP_2()
{
_GPIOC_(GPIOX_CRH) &= ~((4+1)<<0);
_GPIOC_(GPIOX_CRH) |= (8+2)<<0;
}

inline void pinC8_Output_AFPP_10()
{
_GPIOC_(GPIOX_CRH) &= ~((4+2)<<0);
_GPIOC_(GPIOX_CRH) |= (8+1)<<0;
}

inline void pinC8_Output_AFPP_50()
{
_GPIOC_(GPIOX_CRH) &= ~((4)<<0);
_GPIOC_(GPIOX_CRH) |= (8+2+1)<<0;
}

