Ontaelio/STM32F103-Ublink-framework/stm32f103_gpio_func.h
inline void pinC8_Output_AFOD_2()
{
_GPIOC_(GPIOX_CRH) &= ~((1)<<0);
_GPIOC_(GPIOX_CRH) |= (8+2+4)<<0;
}

inline void pinC8_Output_AFOD_10()
{
_GPIOC_(GPIOX_CRH) &= ~((2)<<0);
_GPIOC_(GPIOX_CRH) |= (8+4+1)<<0;
}

inline void pinC8_Output_AFOD_50()
{
_GPIOC_(GPIOX_CRH) |= (8+4+2+1)<<0;
}

inline void pinC9_Input()
{
_GPIOC_(GPIOX_CRH) &= ~((8+2+1)<<4);
_GPIOC_(GPIOX_CRH) |= (4)<<4;
}

inline void pinC9_Input_PU()
{
_GPIOC_(GPIOX_CRH) &= ~((4+2+1)<<4);
_GPIOC_(GPIOX_CRH) |= (8)<<4;
_GPIOC_(GPIOX_ODR) |= (1)<<1;
}

inline void pinC9_Input_PD()
{
_GPIOC_(GPIOX_CRH) &= ~((4+2+1)<<4);
_GPIOC_(GPIOX_CRH) |= (8)<<4;
_GPIOC_(GPIOX_ODR) &= ~(1<<1);
}

inline void pinC9_Analog()
{
_GPIOC_(GPIOX_CRH) &= ~((8+4+2+1)<<4);
}

inline void pinC9_Output()
{
_GPIOC_(GPIOX_CRH) &= ~((8+4+1)<<4);
_GPIOC_(GPIOX_CRH) |= (2)<<4;
}

inline void pinC9_Output_OD()
{
_GPIOC_(GPIOX_CRH) &= ~((8+1)<<4);
_GPIOC_(GPIOX_CRH) |= (2+4)<<4;
}

inline void pinC9_Output_PP_2()
{
_GPIOC_(GPIOX_CRH) &= ~((8+4+1)<<4);
_GPIOC_(GPIOX_CRH) |= (2)<<4;
}

inline void pinC9_Output_PP_10()
{
_GPIOC_(GPIOX_CRH) &= ~((8+4+2)<<4);
_GPIOC_(GPIOX_CRH) |= (1)<<4;
}

inline void pinC9_Output_PP_50()
{
_GPIOC_(GPIOX_CRH) &= ~((8+4)<<4);
_GPIOC_(GPIOX_CRH) |= (2+1)<<4;
}

inline void pinC9_Output_OD_2()
{
_GPIOC_(GPIOX_CRH) &= ~((8+1)<<4);
_GPIOC_(GPIOX_CRH) |= (2+4)<<4;
}

inline void pinC9_Output_OD_10()
{
_GPIOC_(GPIOX_CRH) &= ~((8+2)<<4);
_GPIOC_(GPIOX_CRH) |= (4+1)<<4;
}

inline void pinC9_Output_OD_50()
{
_GPIOC_(GPIOX_CRH) &= ~((8)<<4);
_GPIOC_(GPIOX_CRH) |= (4+2+1)<<4;
}

inline void pinC9_Output_AFPP_2()
{
_GPIOC_(GPIOX_CRH) &= ~((4+1)<<4);
_GPIOC_(GPIOX_CRH) |= (8+2)<<4;
}

inline void pinC9_Output_AFPP_10()
{
_GPIOC_(GPIOX_CRH) &= ~((4+2)<<4);
_GPIOC_(GPIOX_CRH) |= (8+1)<<4;
}

inline void pinC9_Output_AFPP_50()
{
_GPIOC_(GPIOX_CRH) &= ~((4)<<4);
_GPIOC_(GPIOX_CRH) |= (8+2+1)<<4;
}

inline void pinC9_Output_AFOD_2()
{
_GPIOC_(GPIOX_CRH) &= ~((1)<<4);
_GPIOC_(GPIOX_CRH) |= (8+2+4)<<4;
}

inline void pinC9_Output_AFOD_10()
{
_GPIOC_(GPIOX_CRH) &= ~((2)<<4);
_GPIOC_(GPIOX_CRH) |= (8+4+1)<<4;
}

inline void pinC9_Output_AFOD_50()
{
_GPIOC_(GPIOX_CRH) |= (8+4+2+1)<<4;
}

inline void pinC10_Input()
{
_GPIOC_(GPIOX_CRH) &= ~((8+2+1)<<8);
_GPIOC_(GPIOX_CRH) |= (4)<<8;
}

inline void pinC10_Input_PU()
{
_GPIOC_(GPIOX_CRH) &= ~((4+2+1)<<8);
_GPIOC_(GPIOX_CRH) |= (8)<<8;
_GPIOC_(GPIOX_ODR) |= (1)<<2;
}

inline void pinC10_Input_PD()
{
_GPIOC_(GPIOX_CRH) &= ~((4+2+1)<<8);
_GPIOC_(GPIOX_CRH) |= (8)<<8;
_GPIOC_(GPIOX_ODR) &= ~(1<<2);
}

inline void pinC10_Analog()
{
_GPIOC_(GPIOX_CRH) &= ~((8+4+2+1)<<8);
}

inline void pinC10_Output()
{
_GPIOC_(GPIOX_CRH) &= ~((8+4+1)<<8);
_GPIOC_(GPIOX_CRH) |= (2)<<8;
}

inline void pinC10_Output_OD()
{
_GPIOC_(GPIOX_CRH) &= ~((8+1)<<8);
_GPIOC_(GPIOX_CRH) |= (2+4)<<8;
}

inline void pinC10_Output_PP_2()
{
_GPIOC_(GPIOX_CRH) &= ~((8+4+1)<<8);
_GPIOC_(GPIOX_CRH) |= (2)<<8;
}

inline void pinC10_Output_PP_10()
{
_GPIOC_(GPIOX_CRH) &= ~((8+4+2)<<8);
_GPIOC_(GPIOX_CRH) |= (1)<<8;
}

inline void pinC10_Output_PP_50()
{
_GPIOC_(GPIOX_CRH) &= ~((8+4)<<8);
_GPIOC_(GPIOX_CRH) |= (2+1)<<8;
}

inline void pinC10_Output_OD_2()
{
_GPIOC_(GPIOX_CRH) &= ~((8+1)<<8);
_GPIOC_(GPIOX_CRH) |= (2+4)<<8;
}

inline void pinC10_Output_OD_10()
{
_GPIOC_(GPIOX_CRH) &= ~((8+2)<<8);
_GPIOC_(GPIOX_CRH) |= (4+1)<<8;
}

inline void pinC10_Output_OD_50()
{
_GPIOC_(GPIOX_CRH) &= ~((8)<<8);
_GPIOC_(GPIOX_CRH) |= (4+2+1)<<8;
}

inline void pinC10_Output_AFPP_2()
{
_GPIOC_(GPIOX_CRH) &= ~((4+1)<<8);
_GPIOC_(GPIOX_CRH) |= (8+2)<<8;
}

inline void pinC10_Output_AFPP_10()
{
_GPIOC_(GPIOX_CRH) &= ~((4+2)<<8);
_GPIOC_(GPIOX_CRH) |= (8+1)<<8;
}

inline void pinC10_Output_AFPP_50()
{
_GPIOC_(GPIOX_CRH) &= ~((4)<<8);
_GPIOC_(GPIOX_CRH) |= (8+2+1)<<8;
}

inline void pinC10_Output_AFOD_2()
{
_GPIOC_(GPIOX_CRH) &= ~((1)<<8);
_GPIOC_(GPIOX_CRH) |= (8+2+4)<<8;
}

inline void pinC10_Output_AFOD_10()
{
_GPIOC_(GPIOX_CRH) &= ~((2)<<8);
_GPIOC_(GPIOX_CRH) |= (8+4+1)<<8;
}

inline void pinC10_Output_AFOD_50()
{
_GPIOC_(GPIOX_CRH) |= (8+4+2+1)<<8;
}

inline void pinC11_Input()
{
_GPIOC_(GPIOX_CRH) &= ~((8+2+1)<<12);
_GPIOC_(GPIOX_CRH) |= (4)<<12;
}

inline void pinC11_Input_PU()
{
_GPIOC_(GPIOX_CRH) &= ~((4+2+1)<<12);
_GPIOC_(GPIOX_CRH) |= (8)<<12;
_GPIOC_(GPIOX_ODR) |= (1)<<3;
}

inline void pinC11_Input_PD()
{
_GPIOC_(GPIOX_CRH) &= ~((4+2+1)<<12);
_GPIOC_(GPIOX_CRH) |= (8)<<12;
_GPIOC_(GPIOX_ODR) &= ~(1<<3);
}

inline void pinC11_Analog()
{
_GPIOC_(GPIOX_CRH) &= ~((8+4+2+1)<<12);
}

inline void pinC11_Output()
{
_GPIOC_(GPIOX_CRH) &= ~((8+4+1)<<12);
_GPIOC_(GPIOX_CRH) |= (2)<<12;
}

inline void pinC11_Output_OD()
{
_GPIOC_(GPIOX_CRH) &= ~((8+1)<<12);
_GPIOC_(GPIOX_CRH) |= (2+4)<<12;
}

inline void pinC11_Output_PP_2()
{
_GPIOC_(GPIOX_CRH) &= ~((8+4+1)<<12);
_GPIOC_(GPIOX_CRH) |= (2)<<12;
}

inline void pinC11_Output_PP_10()
{
_GPIOC_(GPIOX_CRH) &= ~((8+4+2)<<12);
_GPIOC_(GPIOX_CRH) |= (1)<<12;
}

inline void pinC11_Output_PP_50()
{
_GPIOC_(GPIOX_CRH) &= ~((8+4)<<12);
_GPIOC_(GPIOX_CRH) |= (2+1)<<12;
}

inline void pinC11_Output_OD_2()
{
_GPIOC_(GPIOX_CRH) &= ~((8+1)<<12);
_GPIOC_(GPIOX_CRH) |= (2+4)<<12;
}

inline void pinC11_Output_OD_10()
{
_GPIOC_(GPIOX_CRH) &= ~((8+2)<<12);
_GPIOC_(GPIOX_CRH) |= (4+1)<<12;
}

inline void pinC11_Output_OD_50()
{
_GPIOC_(GPIOX_CRH) &= ~((8)<<12);
_GPIOC_(GPIOX_CRH) |= (4+2+1)<<12;
}

inline void pinC11_Output_AFPP_2()
{
_GPIOC_(GPIOX_CRH) &= ~((4+1)<<12);
_GPIOC_(GPIOX_CRH) |= (8+2)<<12;
}

inline void pinC11_Output_AFPP_10()
{
_GPIOC_(GPIOX_CRH) &= ~((4+2)<<12);
_GPIOC_(GPIOX_CRH) |= (8+1)<<12;
}

inline void pinC11_Output_AFPP_50()
{
_GPIOC_(GPIOX_CRH) &= ~((4)<<12);
_GPIOC_(GPIOX_CRH) |= (8+2+1)<<12;
}

inline void pinC11_Output_AFOD_2()
{
_GPIOC_(GPIOX_CRH) &= ~((1)<<12);
_GPIOC_(GPIOX_CRH) |= (8+2+4)<<12;
}

inline void pinC11_Output_AFOD_10()
{
_GPIOC_(GPIOX_CRH) &= ~((2)<<12);
_GPIOC_(GPIOX_CRH) |= (8+4+1)<<12;
}

inline void pinC11_Output_AFOD_50()
{
_GPIOC_(GPIOX_CRH) |= (8+4+2+1)<<12;
}

inline void pinC12_Input()
{
_GPIOC_(GPIOX_CRH) &= ~((8+2+1)<<16);
_GPIOC_(GPIOX_CRH) |= (4)<<16;
}

inline void pinC12_Input_PU()
{
_GPIOC_(GPIOX_CRH) &= ~((4+2+1)<<16);
_GPIOC_(GPIOX_CRH) |= (8)<<16;
_GPIOC_(GPIOX_ODR) |= (1)<<4;
}

inline void pinC12_Input_PD()
{
_GPIOC_(GPIOX_CRH) &= ~((4+2+1)<<16);
_GPIOC_(GPIOX_CRH) |= (8)<<16;
_GPIOC_(GPIOX_ODR) &= ~(1<<4);
}

inline void pinC12_Analog()
{
_GPIOC_(GPIOX_CRH) &= ~((8+4+2+1)<<16);
}

inline void pinC12_Output()
{
_GPIOC_(GPIOX_CRH) &= ~((8+4+1)<<16);
_GPIOC_(GPIOX_CRH) |= (2)<<16;
}

