Ontaelio/STM32F103-Ublink-framework/stm32f103_gpio_func.h
inline void pinC12_Output_OD()
{
_GPIOC_(GPIOX_CRH) &= ~((8+1)<<16);
_GPIOC_(GPIOX_CRH) |= (2+4)<<16;
}

inline void pinC12_Output_PP_2()
{
_GPIOC_(GPIOX_CRH) &= ~((8+4+1)<<16);
_GPIOC_(GPIOX_CRH) |= (2)<<16;
}

inline void pinC12_Output_PP_10()
{
_GPIOC_(GPIOX_CRH) &= ~((8+4+2)<<16);
_GPIOC_(GPIOX_CRH) |= (1)<<16;
}

inline void pinC12_Output_PP_50()
{
_GPIOC_(GPIOX_CRH) &= ~((8+4)<<16);
_GPIOC_(GPIOX_CRH) |= (2+1)<<16;
}

inline void pinC12_Output_OD_2()
{
_GPIOC_(GPIOX_CRH) &= ~((8+1)<<16);
_GPIOC_(GPIOX_CRH) |= (2+4)<<16;
}

inline void pinC12_Output_OD_10()
{
_GPIOC_(GPIOX_CRH) &= ~((8+2)<<16);
_GPIOC_(GPIOX_CRH) |= (4+1)<<16;
}

inline void pinC12_Output_OD_50()
{
_GPIOC_(GPIOX_CRH) &= ~((8)<<16);
_GPIOC_(GPIOX_CRH) |= (4+2+1)<<16;
}

inline void pinC12_Output_AFPP_2()
{
_GPIOC_(GPIOX_CRH) &= ~((4+1)<<16);
_GPIOC_(GPIOX_CRH) |= (8+2)<<16;
}

inline void pinC12_Output_AFPP_10()
{
_GPIOC_(GPIOX_CRH) &= ~((4+2)<<16);
_GPIOC_(GPIOX_CRH) |= (8+1)<<16;
}

inline void pinC12_Output_AFPP_50()
{
_GPIOC_(GPIOX_CRH) &= ~((4)<<16);
_GPIOC_(GPIOX_CRH) |= (8+2+1)<<16;
}

inline void pinC12_Output_AFOD_2()
{
_GPIOC_(GPIOX_CRH) &= ~((1)<<16);
_GPIOC_(GPIOX_CRH) |= (8+2+4)<<16;
}

inline void pinC12_Output_AFOD_10()
{
_GPIOC_(GPIOX_CRH) &= ~((2)<<16);
_GPIOC_(GPIOX_CRH) |= (8+4+1)<<16;
}

inline void pinC12_Output_AFOD_50()
{
_GPIOC_(GPIOX_CRH) |= (8+4+2+1)<<16;
}

inline void pinC13_Input()
{
_GPIOC_(GPIOX_CRH) &= ~((8+2+1)<<20);
_GPIOC_(GPIOX_CRH) |= (4)<<20;
}

inline void pinC13_Input_PU()
{
_GPIOC_(GPIOX_CRH) &= ~((4+2+1)<<20);
_GPIOC_(GPIOX_CRH) |= (8)<<20;
_GPIOC_(GPIOX_ODR) |= (1)<<5;
}

inline void pinC13_Input_PD()
{
_GPIOC_(GPIOX_CRH) &= ~((4+2+1)<<20);
_GPIOC_(GPIOX_CRH) |= (8)<<20;
_GPIOC_(GPIOX_ODR) &= ~(1<<5);
}

inline void pinC13_Analog()
{
_GPIOC_(GPIOX_CRH) &= ~((8+4+2+1)<<20);
}

inline void pinC13_Output()
{
_GPIOC_(GPIOX_CRH) &= ~((8+4+1)<<20);
_GPIOC_(GPIOX_CRH) |= (2)<<20;
}

inline void pinC13_Output_OD()
{
_GPIOC_(GPIOX_CRH) &= ~((8+1)<<20);
_GPIOC_(GPIOX_CRH) |= (2+4)<<20;
}

inline void pinC13_Output_PP_2()
{
_GPIOC_(GPIOX_CRH) &= ~((8+4+1)<<20);
_GPIOC_(GPIOX_CRH) |= (2)<<20;
}

inline void pinC13_Output_PP_10()
{
_GPIOC_(GPIOX_CRH) &= ~((8+4+2)<<20);
_GPIOC_(GPIOX_CRH) |= (1)<<20;
}

inline void pinC13_Output_PP_50()
{
_GPIOC_(GPIOX_CRH) &= ~((8+4)<<20);
_GPIOC_(GPIOX_CRH) |= (2+1)<<20;
}

inline void pinC13_Output_OD_2()
{
_GPIOC_(GPIOX_CRH) &= ~((8+1)<<20);
_GPIOC_(GPIOX_CRH) |= (2+4)<<20;
}

inline void pinC13_Output_OD_10()
{
_GPIOC_(GPIOX_CRH) &= ~((8+2)<<20);
_GPIOC_(GPIOX_CRH) |= (4+1)<<20;
}

inline void pinC13_Output_OD_50()
{
_GPIOC_(GPIOX_CRH) &= ~((8)<<20);
_GPIOC_(GPIOX_CRH) |= (4+2+1)<<20;
}

inline void pinC13_Output_AFPP_2()
{
_GPIOC_(GPIOX_CRH) &= ~((4+1)<<20);
_GPIOC_(GPIOX_CRH) |= (8+2)<<20;
}

inline void pinC13_Output_AFPP_10()
{
_GPIOC_(GPIOX_CRH) &= ~((4+2)<<20);
_GPIOC_(GPIOX_CRH) |= (8+1)<<20;
}

inline void pinC13_Output_AFPP_50()
{
_GPIOC_(GPIOX_CRH) &= ~((4)<<20);
_GPIOC_(GPIOX_CRH) |= (8+2+1)<<20;
}

inline void pinC13_Output_AFOD_2()
{
_GPIOC_(GPIOX_CRH) &= ~((1)<<20);
_GPIOC_(GPIOX_CRH) |= (8+2+4)<<20;
}

inline void pinC13_Output_AFOD_10()
{
_GPIOC_(GPIOX_CRH) &= ~((2)<<20);
_GPIOC_(GPIOX_CRH) |= (8+4+1)<<20;
}

inline void pinC13_Output_AFOD_50()
{
_GPIOC_(GPIOX_CRH) |= (8+4+2+1)<<20;
}

inline void pinC14_Input()
{
_GPIOC_(GPIOX_CRH) &= ~((8+2+1)<<24);
_GPIOC_(GPIOX_CRH) |= (4)<<24;
}

inline void pinC14_Input_PU()
{
_GPIOC_(GPIOX_CRH) &= ~((4+2+1)<<24);
_GPIOC_(GPIOX_CRH) |= (8)<<24;
_GPIOC_(GPIOX_ODR) |= (1)<<6;
}

inline void pinC14_Input_PD()
{
_GPIOC_(GPIOX_CRH) &= ~((4+2+1)<<24);
_GPIOC_(GPIOX_CRH) |= (8)<<24;
_GPIOC_(GPIOX_ODR) &= ~(1<<6);
}

inline void pinC14_Analog()
{
_GPIOC_(GPIOX_CRH) &= ~((8+4+2+1)<<24);
}

inline void pinC14_Output()
{
_GPIOC_(GPIOX_CRH) &= ~((8+4+1)<<24);
_GPIOC_(GPIOX_CRH) |= (2)<<24;
}

inline void pinC14_Output_OD()
{
_GPIOC_(GPIOX_CRH) &= ~((8+1)<<24);
_GPIOC_(GPIOX_CRH) |= (2+4)<<24;
}

inline void pinC14_Output_PP_2()
{
_GPIOC_(GPIOX_CRH) &= ~((8+4+1)<<24);
_GPIOC_(GPIOX_CRH) |= (2)<<24;
}

inline void pinC14_Output_PP_10()
{
_GPIOC_(GPIOX_CRH) &= ~((8+4+2)<<24);
_GPIOC_(GPIOX_CRH) |= (1)<<24;
}

inline void pinC14_Output_PP_50()
{
_GPIOC_(GPIOX_CRH) &= ~((8+4)<<24);
_GPIOC_(GPIOX_CRH) |= (2+1)<<24;
}

inline void pinC14_Output_OD_2()
{
_GPIOC_(GPIOX_CRH) &= ~((8+1)<<24);
_GPIOC_(GPIOX_CRH) |= (2+4)<<24;
}

inline void pinC14_Output_OD_10()
{
_GPIOC_(GPIOX_CRH) &= ~((8+2)<<24);
_GPIOC_(GPIOX_CRH) |= (4+1)<<24;
}

inline void pinC14_Output_OD_50()
{
_GPIOC_(GPIOX_CRH) &= ~((8)<<24);
_GPIOC_(GPIOX_CRH) |= (4+2+1)<<24;
}

inline void pinC14_Output_AFPP_2()
{
_GPIOC_(GPIOX_CRH) &= ~((4+1)<<24);
_GPIOC_(GPIOX_CRH) |= (8+2)<<24;
}

inline void pinC14_Output_AFPP_10()
{
_GPIOC_(GPIOX_CRH) &= ~((4+2)<<24);
_GPIOC_(GPIOX_CRH) |= (8+1)<<24;
}

inline void pinC14_Output_AFPP_50()
{
_GPIOC_(GPIOX_CRH) &= ~((4)<<24);
_GPIOC_(GPIOX_CRH) |= (8+2+1)<<24;
}

inline void pinC14_Output_AFOD_2()
{
_GPIOC_(GPIOX_CRH) &= ~((1)<<24);
_GPIOC_(GPIOX_CRH) |= (8+2+4)<<24;
}

inline void pinC14_Output_AFOD_10()
{
_GPIOC_(GPIOX_CRH) &= ~((2)<<24);
_GPIOC_(GPIOX_CRH) |= (8+4+1)<<24;
}

inline void pinC14_Output_AFOD_50()
{
_GPIOC_(GPIOX_CRH) |= (8+4+2+1)<<24;
}

inline void pinC15_Input()
{
_GPIOC_(GPIOX_CRH) &= ~((8+2+1)<<28);
_GPIOC_(GPIOX_CRH) |= (4)<<28;
}

inline void pinC15_Input_PU()
{
_GPIOC_(GPIOX_CRH) &= ~((4+2+1)<<28);
_GPIOC_(GPIOX_CRH) |= (8)<<28;
_GPIOC_(GPIOX_ODR) |= (1)<<7;
}

inline void pinC15_Input_PD()
{
_GPIOC_(GPIOX_CRH) &= ~((4+2+1)<<28);
_GPIOC_(GPIOX_CRH) |= (8)<<28;
_GPIOC_(GPIOX_ODR) &= ~(1<<7);
}

inline void pinC15_Analog()
{
_GPIOC_(GPIOX_CRH) &= ~((8+4+2+1)<<28);
}

inline void pinC15_Output()
{
_GPIOC_(GPIOX_CRH) &= ~((8+4+1)<<28);
_GPIOC_(GPIOX_CRH) |= (2)<<28;
}

inline void pinC15_Output_OD()
{
_GPIOC_(GPIOX_CRH) &= ~((8+1)<<28);
_GPIOC_(GPIOX_CRH) |= (2+4)<<28;
}

inline void pinC15_Output_PP_2()
{
_GPIOC_(GPIOX_CRH) &= ~((8+4+1)<<28);
_GPIOC_(GPIOX_CRH) |= (2)<<28;
}

inline void pinC15_Output_PP_10()
{
_GPIOC_(GPIOX_CRH) &= ~((8+4+2)<<28);
_GPIOC_(GPIOX_CRH) |= (1)<<28;
}

inline void pinC15_Output_PP_50()
{
_GPIOC_(GPIOX_CRH) &= ~((8+4)<<28);
_GPIOC_(GPIOX_CRH) |= (2+1)<<28;
}

inline void pinC15_Output_OD_2()
{
_GPIOC_(GPIOX_CRH) &= ~((8+1)<<28);
_GPIOC_(GPIOX_CRH) |= (2+4)<<28;
}

inline void pinC15_Output_OD_10()
{
_GPIOC_(GPIOX_CRH) &= ~((8+2)<<28);
_GPIOC_(GPIOX_CRH) |= (4+1)<<28;
}

inline void pinC15_Output_OD_50()
{
_GPIOC_(GPIOX_CRH) &= ~((8)<<28);
_GPIOC_(GPIOX_CRH) |= (4+2+1)<<28;
}

