Ontaelio/STM32F103-Ublink-framework/stm32f103_gpio_func.h
inline void pinC15_Output_AFPP_2()
{
_GPIOC_(GPIOX_CRH) &= ~((4+1)<<28);
_GPIOC_(GPIOX_CRH) |= (8+2)<<28;
}

inline void pinC15_Output_AFPP_10()
{
_GPIOC_(GPIOX_CRH) &= ~((4+2)<<28);
_GPIOC_(GPIOX_CRH) |= (8+1)<<28;
}

inline void pinC15_Output_AFPP_50()
{
_GPIOC_(GPIOX_CRH) &= ~((4)<<28);
_GPIOC_(GPIOX_CRH) |= (8+2+1)<<28;
}

inline void pinC15_Output_AFOD_2()
{
_GPIOC_(GPIOX_CRH) &= ~((1)<<28);
_GPIOC_(GPIOX_CRH) |= (8+2+4)<<28;
}

inline void pinC15_Output_AFOD_10()
{
_GPIOC_(GPIOX_CRH) &= ~((2)<<28);
_GPIOC_(GPIOX_CRH) |= (8+4+1)<<28;
}

inline void pinC15_Output_AFOD_50()
{
_GPIOC_(GPIOX_CRH) |= (8+4+2+1)<<28;
}

inline uint8_t readPinC0()
{
return ((_GPIOC_(GPIOX_IDR)>>0) & 1);
}

inline void setPinC0()
{
_GPIOC_(GPIOX_BSRR) = (1<<0);
}

inline void resetPinC0()
{
_GPIOC_(GPIOX_BRR) = (1<<0);
}

inline uint8_t readPinC1()
{
return ((_GPIOC_(GPIOX_IDR)>>1) & 1);
}

inline void setPinC1()
{
_GPIOC_(GPIOX_BSRR) = (1<<1);
}

inline void resetPinC1()
{
_GPIOC_(GPIOX_BRR) = (1<<1);
}

inline uint8_t readPinC2()
{
return ((_GPIOC_(GPIOX_IDR)>>2) & 1);
}

inline void setPinC2()
{
_GPIOC_(GPIOX_BSRR) = (1<<2);
}

inline void resetPinC2()
{
_GPIOC_(GPIOX_BRR) = (1<<2);
}

inline uint8_t readPinC3()
{
return ((_GPIOC_(GPIOX_IDR)>>3) & 1);
}

inline void setPinC3()
{
_GPIOC_(GPIOX_BSRR) = (1<<3);
}

inline void resetPinC3()
{
_GPIOC_(GPIOX_BRR) = (1<<3);
}

inline uint8_t readPinC4()
{
return ((_GPIOC_(GPIOX_IDR)>>4) & 1);
}

inline void setPinC4()
{
_GPIOC_(GPIOX_BSRR) = (1<<4);
}

inline void resetPinC4()
{
_GPIOC_(GPIOX_BRR) = (1<<4);
}

inline uint8_t readPinC5()
{
return ((_GPIOC_(GPIOX_IDR)>>5) & 1);
}

inline void setPinC5()
{
_GPIOC_(GPIOX_BSRR) = (1<<5);
}

inline void resetPinC5()
{
_GPIOC_(GPIOX_BRR) = (1<<5);
}

inline uint8_t readPinC6()
{
return ((_GPIOC_(GPIOX_IDR)>>6) & 1);
}

inline void setPinC6()
{
_GPIOC_(GPIOX_BSRR) = (1<<6);
}

inline void resetPinC6()
{
_GPIOC_(GPIOX_BRR) = (1<<6);
}

inline uint8_t readPinC7()
{
return ((_GPIOC_(GPIOX_IDR)>>7) & 1);
}

inline void setPinC7()
{
_GPIOC_(GPIOX_BSRR) = (1<<7);
}

inline void resetPinC7()
{
_GPIOC_(GPIOX_BRR) = (1<<7);
}

inline uint8_t readPinC8()
{
return ((_GPIOC_(GPIOX_IDR)>>8) & 1);
}

inline void setPinC8()
{
_GPIOC_(GPIOX_BSRR) = (1<<8);
}

inline void resetPinC8()
{
_GPIOC_(GPIOX_BRR) = (1<<8);
}

inline uint8_t readPinC9()
{
return ((_GPIOC_(GPIOX_IDR)>>9) & 1);
}

inline void setPinC9()
{
_GPIOC_(GPIOX_BSRR) = (1<<9);
}

inline void resetPinC9()
{
_GPIOC_(GPIOX_BRR) = (1<<9);
}

inline uint8_t readPinC10()
{
return ((_GPIOC_(GPIOX_IDR)>>10) & 1);
}

inline void setPinC10()
{
_GPIOC_(GPIOX_BSRR) = (1<<10);
}

inline void resetPinC10()
{
_GPIOC_(GPIOX_BRR) = (1<<10);
}

inline uint8_t readPinC11()
{
return ((_GPIOC_(GPIOX_IDR)>>11) & 1);
}

inline void setPinC11()
{
_GPIOC_(GPIOX_BSRR) = (1<<11);
}

inline void resetPinC11()
{
_GPIOC_(GPIOX_BRR) = (1<<11);
}

inline uint8_t readPinC12()
{
return ((_GPIOC_(GPIOX_IDR)>>12) & 1);
}

inline void setPinC12()
{
_GPIOC_(GPIOX_BSRR) = (1<<12);
}

inline void resetPinC12()
{
_GPIOC_(GPIOX_BRR) = (1<<12);
}

inline uint8_t readPinC13()
{
return ((_GPIOC_(GPIOX_IDR)>>13) & 1);
}

inline void setPinC13()
{
_GPIOC_(GPIOX_BSRR) = (1<<13);
}

inline void resetPinC13()
{
_GPIOC_(GPIOX_BRR) = (1<<13);
}

inline uint8_t readPinC14()
{
return ((_GPIOC_(GPIOX_IDR)>>14) & 1);
}

inline void setPinC14()
{
_GPIOC_(GPIOX_BSRR) = (1<<14);
}

inline void resetPinC14()
{
_GPIOC_(GPIOX_BRR) = (1<<14);
}

inline uint8_t readPinC15()
{
return ((_GPIOC_(GPIOX_IDR)>>15) & 1);
}

inline void setPinC15()
{
_GPIOC_(GPIOX_BSRR) = (1<<15);
}

inline void resetPinC15()
{
_GPIOC_(GPIOX_BRR) = (1<<15);
}



#endif /* STM32F103_GPIO_FUNC_H_ */
